<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>mykonakona</title>
  
  <subtitle>Just Another Weblog</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://mykonakona.github.io/"/>
  <updated>2020-11-18T11:46:35.023Z</updated>
  <id>http://mykonakona.github.io/</id>
  
  <author>
    <name>mykonakona</name>
    
  </author>
  
  <generator uri="https://hexo.io/">Hexo</generator>
  
  <entry>
    <title>抖音自动点赞</title>
    <link href="http://mykonakona.github.io/2020/11/16/douyin-auto-thumbup/"/>
    <id>http://mykonakona.github.io/2020/11/16/douyin-auto-thumbup/</id>
    <published>2020-11-16T08:04:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x4E3B;&#x64AD;&#x4F1A;&#x628A;&#x70B9;&#x8D5E;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x4E07;&#x4F5C;&#x4E3A;&#x4E00;&#x9879;&#x6307;&#x6807;&#xFF0C;&#x81EA;&#x5DF1;&#x53C8;&#x61D2;&#x5F97;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x628A;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x7ED9;&#x81EA;&#x52A8;&#x5316;&#x3002;</p><p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x641C;&#x5230;&#x7684;&#x5B9E;&#x73B0;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x57FA;&#x4E8E;adb&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x964B;&#x7684;&#x6574;&#x5408;&#x4E86;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x7684;win&#x4E0B;&#x7684;&#x6559;&#x5B66;&#x3002;</p><p>&#x5176;&#x539F;&#x7406;&#x4E3A;&#xFF1A;&#x76F4;&#x63A5;&#x4F7F;&#x7528;adb&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x901F;&#x5EA6;&#x4F1A;&#x4E0D;&#x591F;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BB0;&#x5F55;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x518D;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x6A21;&#x62DF;&#x5728;dy&#x4E3B;&#x64AD;&#x754C;&#x9762;&#x5FEB;&#x901F;&#x70B9;&#x51FB;&#x7684;&#x884C;&#x4E3A;&#x3002;</p><a id="more"></a><ol><li><p>&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#xFF08;&#x672C;&#x6587;&#x4F7F;&#x7528;&#x591C;&#x795E;&#x6A21;&#x62DF;&#x5668;&#xFF09;&#x5E76;&#x5B89;&#x88C5;&#xFF0C;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x540E;&#x5728;&#x6A21;&#x62DF;&#x5668;&#x5185;&#x5B89;&#x88C5;dy&#xFF0C;&#x767B;&#x5F55;&#x5DF2;&#x7ECF;&#x5173;&#x6CE8;&#x4E3B;&#x64AD;&#x7684;&#x6296;&#x97F3;&#x8D26;&#x53F7;&#xFF0C;&#x5E76;&#x8FDB;&#x5165;&#x76F4;&#x64AD;&#x9875;&#x9762;</p></li><li><p>&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x8FDB;&#x5165;nox_adb.exe&#x6240;&#x5728;&#x76EE;&#x5F55;&#xFF08;&#x547D;&#x4EE4;&#x4E3A;&#x9ED8;&#x8BA4;&#x5B89;&#x88C5;&#x4F4D;&#x7F6E;&#xFF09;&#xFF1A;cd &#x201C;C:\Program Files (x86)\Nox\bin&quot;</p></li><li><p>&#x8FDB;&#x5165;&#x591C;&#x795E;&#x6A21;&#x62DF;&#x5668;&#x7684;adb shell&#xFF1A;nox_adb shell</p></li><li><p>&#x8FDB;&#x5165;shell&#x540E;&#xFF0C;&#x51C6;&#x5907;&#x8BB0;&#x5F55;&#x8F93;&#x5165;&#x64CD;&#x4F5C;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x5EFA;&#x7684;recordtap&#x6587;&#x4EF6;&#x5185;&#xFF1A;dd if=/dev/input/event5 of=/sdcard/recordtap&#xFF0C;&#x5177;&#x4F53;&#x662F;event5&#x6216;&#x5176;&#x4ED6;&#xFF08;&#x5982;event1&#x7B49;&#xFF09;&#x53EF;&#x5728;shell&#x4E2D;&#x901A;&#x8FC7;getevent&#x547D;&#x4EE4;&#x67E5;&#x8BE2;</p></li><li><p>&#x56DE;&#x5230;&#x6A21;&#x62DF;&#x5668;&#x7684;&#x76F4;&#x64AD;&#x9875;&#x9762;&#xFF0C;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x91CD;&#x590D;&#x5FEB;&#x901F;&#x70B9;&#x51FB;</p></li><li><p>&#x9000;&#x51FA;adb shell&#xFF08;&#x5982;&#x5FEB;&#x6377;&#x952E;&#x65E0;&#x6548;&#xFF0C;&#x53EF;&#x5173;&#x6389;&#x547D;&#x4EE4;&#x884C;&#x7A97;&#x53E3;&#x540E;&#x91CD;&#x5F00;&#xFF09;</p></li><li><p>&#x91CD;&#x65B0;&#x8FDB;&#x5165;adb shell&#xFF0C;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#xFF08;&#x6B64;&#x4E3A;&#x5FAA;&#x73AF;100&#x6B21;&#x7248;&#x672C;&#xFF09;&#xFF1A;   </p><p> for i in <code>seq 1 100</code>; do dd if=/sdcard/recordtap of=/dev/input/event5;sleep 0.1; done </p></li><li><p>&#x591A;&#x5F00;&#x65F6;&#x76F4;&#x63A5;&#x6267;&#x884C;nox_adb shell&#x4F1A;&#x62A5; error: more than one device and emulator&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x65F6;&#x9700;&#x8981;&#x5148;nox_adb devices&#x67E5;&#x770B;&#x5F53;&#x524D;&#x6709;&#x8BBE;&#x5907;&#x4E0E;&#x6A21;&#x62DF;&#x5668;&#xFF1A;</p><p> C:\Program Files (x86)\Nox\bin&gt;nox_adb devices<br> List of devices attached<br> 127.0.0.1:62025 device<br> 127.0.0.1:62001 device</p></li><li><p>&#x5728;&#x6267;&#x884C;adb&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x4E3A;&#x547D;&#x4EE4;&#x6307;&#x5B9A;&#x8BBE;&#x5907;&#x7684;&#x5E8F;&#x5217;&#x53F7;<code>nox_adb -s 127.0.0.1:62025 shell</code></p></li></ol><p>&#x8BF4;&#x660E;&#xFF1A;</p><p>&#x4F7F;&#x7528;&#x591C;&#x795E;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#x7684;ADB&#x6307;&#x4EE4;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5C06;adb&#x6539;&#x4E3A;nox_adb&#xFF0C;&#x5982;nox_adb devices&#x5BF9;&#x5E94;adb devices&#xFF0C;nox_adb shell&#x5BF9;&#x5E94;adb shell&#x3002;</p><p>&#x53C2;&#x8003;&#xFF1A;</p><p><a href="https://www.jianshu.com/p/7c565eab821d" target="_blank" rel="noopener">https://www.jianshu.com/p/7c565eab821d</a></p><p><a href="https://blog.csdn.net/gaojinshan/article/details/9455193" target="_blank" rel="noopener">https://blog.csdn.net/gaojinshan/article/details/9455193</a></p><p><a href="https://www.yeshen.com/faqs/ByPpRoflZ" target="_blank" rel="noopener">https://www.yeshen.com/faqs/ByPpRoflZ</a></p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x56E0;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E9B;&amp;#x4E3B;&amp;#x64AD;&amp;#x4F1A;&amp;#x628A;&amp;#x70B9;&amp;#x8D5E;&amp;#x8FBE;&amp;#x5230;&amp;#x591A;&amp;#x5C11;&amp;#x4E07;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x9879;&amp;#x6307;&amp;#x6807;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x53C8;&amp;#x61D2;&amp;#x5F97;&amp;#x70B9;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x60F3;&amp;#x628A;&amp;#x8FD9;&amp;#x4E2A;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7ED9;&amp;#x81EA;&amp;#x52A8;&amp;#x5316;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x73B0;&amp;#x5728;&amp;#x53EF;&amp;#x4EE5;&amp;#x641C;&amp;#x5230;&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#x57FA;&amp;#x672C;&amp;#x90FD;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;adb&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B80;&amp;#x964B;&amp;#x7684;&amp;#x6574;&amp;#x5408;&amp;#x4E86;&amp;#x76F8;&amp;#x5173;&amp;#x8D44;&amp;#x6599;&amp;#x7684;win&amp;#x4E0B;&amp;#x7684;&amp;#x6559;&amp;#x5B66;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x539F;&amp;#x7406;&amp;#x4E3A;&amp;#xFF1A;&amp;#x76F4;&amp;#x63A5;&amp;#x4F7F;&amp;#x7528;adb&amp;#x7684;&amp;#x70B9;&amp;#x51FB;&amp;#x4E8B;&amp;#x4EF6;&amp;#x901F;&amp;#x5EA6;&amp;#x4F1A;&amp;#x4E0D;&amp;#x591F;&amp;#x5FEB;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x901A;&amp;#x8FC7;&amp;#x8BB0;&amp;#x5F55;&amp;#x7528;&amp;#x6237;&amp;#x64CD;&amp;#x4F5C;&amp;#x518D;&amp;#x8F93;&amp;#x51FA;&amp;#x7684;&amp;#x65B9;&amp;#x5F0F;&amp;#x6A21;&amp;#x62DF;&amp;#x5728;dy&amp;#x4E3B;&amp;#x64AD;&amp;#x754C;&amp;#x9762;&amp;#x5FEB;&amp;#x901F;&amp;#x70B9;&amp;#x51FB;&amp;#x7684;&amp;#x884C;&amp;#x4E3A;&amp;#x3002;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="coding" scheme="http://mykonakona.github.io/categories/coding/"/>
    
    
      <category term="android" scheme="http://mykonakona.github.io/tags/android/"/>
    
  </entry>
  
  <entry>
    <title>聊聊Yoga S740</title>
    <link href="http://mykonakona.github.io/2020/09/04/lenovo-yoga-s740-review/"/>
    <id>http://mykonakona.github.io/2020/09/04/lenovo-yoga-s740-review/</id>
    <published>2020-09-04T14:32:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>Yoga S740&#x4ECE;4&#x6708;&#x4EFD;&#x5165;&#x624B;&#x540E;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4E86;&#x8FD1;5&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x60F3;&#x7B80;&#x5355;&#x804A;&#x804A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x4E0A;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p><a id="more"></a><p>&#x5728;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x6362;&#x673A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x624B;&#x4E0A;&#x670D;&#x5F79;&#x7684;&#x673A;&#x5668;&#x8FD8;&#x662F;&#x4E00;&#x53F0;13&#x5E74;&#x8D2D;&#x4E70;&#x7684;Dell Vostro&#x7CFB;&#x5217;&#x3002;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x786C;&#x76D8;&#x3001;&#x98CE;&#x6247;&#x751A;&#x81F3;&#x4E8E;&#x952E;&#x76D8;C&#x9762;&#x548C;D&#x58F3;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x6211;&#x6362;&#x4E86;&#x4E2A;&#x904D;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x8FD8;&#x5269;&#x5C4F;&#x5E55;&#x6CA1;&#x6709;&#x52A8;&#x8FC7;&#x3002;&#x4EE5;&#x4E3A;&#x4FEE;&#x4FEE;&#x8865;&#x8865;&#x8FD8;&#x53EF;&#x4EE5;&#x575A;&#x6301;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5728;&#x6570;&#x4E0D;&#x6E05;&#x662F;&#x7B2C;&#x51E0;&#x6B21;&#x6F0F;&#x7535;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x8FD8;&#x662F;&#x53D7;&#x4E0D;&#x4E86;&#x4E86;&#x3002;</p><p>&#x51B3;&#x5B9A;&#x8D2D;&#x673A;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x5206;&#x6790;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5927;&#x4F53;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p><ul><li>&#x80FD;&#x505A;&#x4E2D;&#x5EA6;&#x7684;&#x89C6;&#x9891;&#x526A;&#x8F91;&#x548C;&#x6E32;&#x67D3;</li><li>&#x53EF;&#x4EE5;&#x73A9;&#x5F97;&#x52A8;&#x6587;&#x660E;6&#x6216;&#x8005;&#x6B27;&#x9646;&#x98CE;&#x4E91;4</li><li>&#x5185;&#x5B58;16G&#xFF0C;&#x4FBF;&#x4E8E;&#x5F00;&#x865A;&#x62DF;&#x673A;&#xFF1B;&#x786C;&#x76D8;512G&#x8D77;&#x6B65;</li><li>&#x5C4F;&#x5E55;&#x5927;&#x5C0F;&#x5728;14&#x5BF8;&#x4EE5;&#x5185;&#xFF0C;&#x539A;&#x5EA6;&#x5C0F;&#x4E8E;2cm</li><li>&#x53EF;&#x4EE5;180&#x5EA6;&#x5F00;&#x5408;</li><li>&#x63A5;&#x53E3;&#x4E0D;&#x80FD;&#x592A;&#x7B80;&#x964B;&#xFF0C;&#x5F97;&#x57FA;&#x672C;&#x591F;&#x7528;</li><li>&#x8F83;&#x957F;&#x7684;&#x7EED;&#x822A;</li><li>&#x4E0D;&#x8981;&#x592A;&#x8D35;&#xFF08;&#x7B11;</li><li>&#x2026;&#x2026;</li></ul><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#x4E2D;&#x5EA6;&#x7684;&#x89C6;&#x9891;&#x526A;&#x8F91;&#x548C;&#x6E38;&#x620F;&#x90FD;&#x5BF9;CPU&#x6709;&#x4E00;&#x5B9A;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x80FD;&#x592A;&#x83DC;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#x6BCF;&#x6B21;&#x8FD8;&#x5F97;&#x5F00;&#x8FDC;&#x7A0B;&#x8FDE;&#x5BB6;&#x91CC;&#x7684;&#x7535;&#x8111;&#x505A;&#x526A;&#x8F91;&#xFF0C;&#x592A;&#x9EBB;&#x70E6;&#x3002;&#x5185;&#x5B58;16G&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x591A;&#x5F00;&#x51E0;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;14&#x5BF8;&#x4EE5;&#x5185;&#x4E5F;&#x57FA;&#x672C;&#x9650;&#x5B9A;&#x53EA;&#x80FD;&#x5728;&#x8F7B;&#x8584;&#x672C;&#x91CC;&#x6311;&#x3002;180&#x5EA6;&#x5F00;&#x5408;&#x7B97;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x4E00;&#x4E2A;&#x559C;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x644A;&#x5F00;&#x4E4B;&#x540E;&#x63D2;&#x663E;&#x793A;&#x5668;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x5F53;&#x65F6;&#x53EA;&#x662F;&#x5728;&#x8111;&#x6D77;&#x91CC;&#x7C97;&#x7565;&#x5730;&#x5217;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x662F;&#x51B2;&#x7740;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53BB;&#x9009;&#x673A;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x5341;&#x5206;&#x540E;&#x6094;&#xFF0C;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x6362;Macbook Pro&#xFF0C;&#x672C;&#x6765;Win&#x7CFB;&#x5217;&#x672C;&#x4E5F;&#x5DF2;&#x7ECF;&#x7528;&#x5230;&#x6709;&#x70B9;&#x5410;&#x4E86;&#xFF0C;&#x4F46;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x8D70;&#x51FA;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x679C;&#x7136;&#x8FD8;&#x662F;&#x7A77;&#x3002;</p><p>&#x5728;&#x5404;&#x79CD;&#x5947;&#x5947;&#x602A;&#x602A;&#x7684;&#x8981;&#x6C42;&#x7684;&#x5F15;&#x5BFC;&#x4E0B;&#x8D70;&#x8FDB;&#x6211;&#x89C6;&#x91CE;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x53F0;S740&#x4E86;&#x3002;&#x5404;&#x79CD;&#x6D4B;&#x8BC4;&#x90FD;&#x6709;&#x63D0;&#x5230;&#x5B83;&#x7684;&#x5404;&#x79CD;&#x4F18;&#x70B9;&#xFF1A;</p><ul><li>3733Mhz&#x7684;&#x677F;&#x8F7D;LPDDR4X&#x5185;&#x5B58;&#xFF0C;&#x7B97;&#x662F;&#x5F53;&#x524D;&#x5E02;&#x9762;&#x4E0A;&#x7B14;&#x8BB0;&#x672C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6700;&#x9AD8;&#x9891;&#x5185;&#x5B58;&#x4E86;</li><li>&#x4E00;&#x5757;DC&#x8C03;&#x5149;&#x3001;72%NTSC&#x3001;400nits&#x7684;&#x5C4F;&#x5E55;&#xFF0C;&#x7D20;&#x8D28;&#x76F8;&#x5F53;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x5757;&#x5C4F;&#x662F;LTPS&#x7684;&#x4F4E;&#x529F;&#x8017;&#x5C4F;&#xFF0C;&#x642D;&#x914D;62Wh&#x7684;&#x5927;&#x5BB9;&#x91CF;&#x7535;&#x6C60;&#xFF0C;&#x7EED;&#x822A;&#x8868;&#x73B0;&#x5F88;&#x4E0D;&#x9519;</li><li>&#x4F7F;&#x7528;10&#x4EE3;CPU&#xFF0C;&#x6027;&#x80FD;&#x91CA;&#x653E;&#x8868;&#x73B0;&#x597D;</li><li>&#x6EE1;&#x8840;&#x96F7;&#x7535;3&#x63A5;&#x53E3;&#xFF0C;WiFi6&#x65E0;&#x7EBF;&#x7F51;&#x5361;</li></ul><p>&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x6709;&#x6CA1;&#x6709;&#x5404;&#x79CD;&#x6D4B;&#x8BC4;&#x8BF4;&#x7684;&#x8FD9;&#x4E48;&#x597D;&#x5462;&#x3002;&#x4ECE;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x611F;&#x53D7;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#x662F;&#x57FA;&#x672C;&#x5C5E;&#x5B9E;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x6CA1;&#x6709;&#x7F3A;&#x70B9;&#x4E86;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x7F3A;&#x70B9;&#x8FD8;&#x4E0D;&#x5C11;&#xFF1A;</p><p>&#x9996;&#x5148;&#xFF0C;&#x5F88;&#x4E0D;&#x80FD;&#x8BA9;&#x4EBA;&#x5FCD;&#x53D7;&#x4E00;&#x70B9;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;C&#x9762;&#x975E;&#x5E38;&#x7684;&#x5C16;&#x9510;&#xFF0C;&#x63E1;&#x6301;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x673A;&#x5668;&#x7684;&#x952E;&#x76D8;&#x624B;&#x611F;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E9B;&#x6D4B;&#x8BC4;&#x91CC;&#x5439;&#x7684;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x7B97;&#x7279;&#x522B;&#x5DEE;&#xFF0C;&#x4F46;&#x51FB;&#x952E;&#x7684;&#x65F6;&#x5019;&#x6709;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x5361;&#x952E;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x63A5;&#x53E3;&#x5E03;&#x5C40;&#x4E5F;&#x4E0D;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x53F3;&#x8FB9;&#x5355;&#x72EC;&#x653E;&#x4E86;&#x4E00;&#x4E2A;&#x5B64;&#x96F6;&#x96F6;&#x7684;USB&#xFF0C;&#x5DE6;&#x8FB9;&#x628A;&#x7535;&#x6E90;&#x53E3;&#xFF0C;&#x96F7;&#x7535;3&#x63A5;&#x53E3;&#xFF0C;USB&#x53E3;&#x548C;&#x8033;&#x673A;&#x53E3;&#x4E00;&#x80A1;&#x8111;&#x513F;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x5F88;&#x62E5;&#x6324;&#x3002;&#x53EA;&#x914D;&#x4E00;&#x4E2A;Type-C&#x63A5;&#x53E3;&#x4E5F;&#x663E;&#x5F97;&#x5F88;&#x5C0F;&#x6C14;&#xFF0C;&#x591A;&#x914D;&#x4E00;&#x4E2A;&#x628A;&#x7535;&#x6E90;&#x53E3;&#x780D;&#x6389;&#x4E0D;&#x597D;&#x4E48;&#x3002;</p><p>&#x6CA1;&#x6709;&#x6307;&#x7EB9;&#x89E3;&#x9501;&#x4E5F;&#x662F;&#x8BA9;&#x4EBA;&#x5F88;&#x8D39;&#x89E3;&#x7684;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x559C;&#x6B22;&#x9762;&#x90E8;&#x89E3;&#x9501;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#x4E5F;&#x4E0D;&#x5F97;&#x4E0D;&#x7528;&#x3002;</p><p>&#x5728;7&#x6708;&#x4EFD;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6389;&#x76D8;&#x4E86;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;SSD&#x8868;&#x73B0;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x633A;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E48;&#x5FEB;&#x5C31;&#x6389;&#x76D8;&#x5B9E;&#x5728;&#x662F;&#x51FA;&#x4E4E;&#x6211;&#x7684;&#x610F;&#x6599;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x53EA;&#x80FD;&#x8054;&#x7CFB;&#x8054;&#x60F3;&#x4E0A;&#x95E8;&#x7EF4;&#x4FEE;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x60F3;&#x7740;&#x627E;&#x5B83;&#x4EEC;&#x514D;&#x8D39;&#x6362;&#x5757;&#x76D8;&#x3002;</p><p>&#x7B49;&#x6765;&#x4E86;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0A;&#x95E8;&#xFF0C;&#x6362;&#x5B8C;&#x786C;&#x76D8;&#x91CD;&#x88C5;&#x4E86;&#x7CFB;&#x7EDF;&#xFF0C;&#x53D1;&#x73B0;&#x89E6;&#x6478;&#x677F;&#x53C8;&#x4E0D;&#x5DE5;&#x4F5C;&#x4E86;&#x2026;&#x2026;&#x4E00;&#x822C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x60F3;&#x7740;&#x53BB;&#x627E;&#x9A71;&#x52A8;&#x88C5;&#x4E0A;&#xFF0C;&#x7ED3;&#x679C;&#x8054;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x627E;&#x4E0D;&#x5230;&#x76F8;&#x5173;&#x7684;&#x9A71;&#x52A8;&#x3002;&#x8FD9;&#x4F4D;&#x8054;&#x60F3;&#x5DE5;&#x7A0B;&#x5E08;&#x8054;&#x7CFB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x8BF4;&#x8FD9;&#x6B3E;&#x673A;&#x5668;&#x89E6;&#x6478;&#x677F;&#x662F;&#x514D;&#x9A71;&#x7684;&#xFF0C;&#x88C5;&#x4E0A;&#x7CFB;&#x7EDF;&#x5C31;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x7ED3;&#x679C;&#x4ED6;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x7684;&#x7CFB;&#x7EDF;&#x53C8;&#x600E;&#x4E48;&#x88C5;&#x90FD;&#x4E0D;&#x884C;&#x2026;&#x2026;&#x6700;&#x540E;&#x8FD9;&#x4F4D;&#x5C0F;&#x54E5;&#x95EE;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x6B21;&#x91CD;&#x88C5;&#x65F6;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x955C;&#x50CF;&#xFF0C;&#x8BF4;&#x8981;&#x4E0D;&#x4F60;&#x81EA;&#x5DF1;&#x91CD;&#x88C5;&#x8BD5;&#x8BD5;&#x3002;&#x5F04;&#x5F97;&#x6211;&#x4E5F;&#x65E0;&#x8BED;&#x4E86;&#x2026;&#x2026;</p><p>&#x540E;&#x6765;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x628A;&#x6211;&#x7684;&#x673A;&#x5668;&#x62FF;&#x56DE;&#x4E86;&#x7EF4;&#x4FEE;&#x7AD9;&#xFF0C;&#x91CD;&#x88C5;&#x4E86;&#x4E00;&#x6B21;&#x51FA;&#x5382;&#x7CFB;&#x7EDF;&#x3002;&#x89E6;&#x6478;&#x677F;&#x7684;&#x95EE;&#x9898;&#x603B;&#x7B97;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x4F46;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x53D7;&#x5C31;&#x662F;&#x8054;&#x60F3;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x633A;&#x6DF7;&#x4E71;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x6709;&#x505A;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x77E5;&#x8BC6;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x5BF9;&#x81EA;&#x5DF1;&#x65B0;&#x63A8;&#x7684;&#x65B0;&#x673A;&#x578B;&#x7684;&#x652F;&#x6301;&#x660E;&#x663E;&#x6EDE;&#x540E;&#x3002;&#x5305;&#x62EC;&#x4E00;&#x5F00;&#x59CB;&#x8FD9;&#x4F4D;&#x5DE5;&#x7A0B;&#x5E08;&#x60F3;&#x7528;PE&#x8FDB;&#x53BB;&#x673A;&#x5668;&#x770B;&#x4E00;&#x770B;&#x786C;&#x76D8;&#x60C5;&#x51B5;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;PE&#x5728;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#xFF0C;&#x6362;&#x4E86;&#x597D;&#x51E0;&#x5957;&#x624D;&#x8FDB;&#x53BB;&#xFF0C;&#x4E5F;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x5BF9;&#x65B0;&#x673A;&#x578B;&#x4E0D;&#x719F;&#x6089;&#x3002;&#x8FD9;&#x6B21;&#x552E;&#x540E;&#x7B97;&#x662F;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4F53;&#x9A8C;&#x8FD8;&#x662F;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x3002;&#x5305;&#x62EC;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x672C;&#x8EAB;&#x4E5F;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x4E0D;&#x5B89;&#x5B9A;&#x611F;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4E5F;&#x8FD8;&#x5728;&#x575A;&#x6301;&#x7528;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7F3A;&#x70B9;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x62B5;&#x6D88;&#x4E86;&#x6211;&#x5BF9;&#x5B83;&#x4F18;&#x70B9;&#x7684;&#x597D;&#x611F;&#x3002;&#x7528;&#x8D77;&#x6765;&#x603B;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x600E;&#x4E48;&#x8212;&#x670D;&#x3002;&#x5E76;&#x4E14;&#x56E0;&#x4E3A;&#x89E6;&#x6478;&#x677F;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x53EA;&#x80FD;&#x7EE7;&#x7EED;&#x7528;&#x5DE5;&#x4F5C;&#x7AD9;&#x91CD;&#x88C5;&#x7684;Win10&#x5BB6;&#x5EAD;&#x7248;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x75DB;&#x82E6;&#x3002;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x611F;&#x609F;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#xFF1A;&#x4E0B;&#x6B21;&#x6362;&#x673A;&#x6211;&#x4E0D;&#x4F1A;&#x518D;&#x60F3;&#x7740;&#x7701;&#x94B1;&#x4E86;&#x3002;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;Yoga S740&amp;#x4ECE;4&amp;#x6708;&amp;#x4EFD;&amp;#x5165;&amp;#x624B;&amp;#x540E;&amp;#x5230;&amp;#x73B0;&amp;#x5728;&amp;#x5DF2;&amp;#x7ECF;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x8FD1;5&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x91CC;&amp;#x60F3;&amp;#x7B80;&amp;#x5355;&amp;#x804A;&amp;#x804A;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x4F7F;&amp;#x7528;&amp;#x4E0A;&amp;#x7684;&amp;#x4F53;&amp;#x9A8C;&amp;#x3002;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="life" scheme="http://mykonakona.github.io/categories/life/"/>
    
    
      <category term="laptop" scheme="http://mykonakona.github.io/tags/laptop/"/>
    
  </entry>
  
  <entry>
    <title>acme.sh的Verify error:Invalid response from报错</title>
    <link href="http://mykonakona.github.io/2020/08/24/acme-verify-error/"/>
    <id>http://mykonakona.github.io/2020/08/24/acme-verify-error/</id>
    <published>2020-08-24T08:49:00.000Z</published>
    <updated>2020-11-18T11:46:35.019Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x4E4B;&#x524D;&#x5728;hostdare&#x8D2D;&#x5165;&#x8FC7;&#x4E00;&#x53F0;VPS&#xFF0C;&#x901F;&#x5EA6;&#x4E00;&#x822C;&#xFF0C;&#x6240;&#x4EE5;&#x62FF;&#x6765;&#x505A;&#x5907;&#x80CE;&#xFF0C;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x90E8;&#x4E86;&#x4E00;&#x4E9B;&#x670D;&#x52A1;&#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x6700;&#x4F4E;&#x9650;&#x5EA6;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x7528;acme&#x7ED9;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x90FD;&#x624B;&#x52A8;&#x751F;&#x6210;&#x4E86;&#x4E00;&#x904D;&#x8BC1;&#x4E66;&#xFF0C;&#x8FD8;&#x633A;&#x9EBB;&#x70E6;&#x7684;&#xFF08;&#x5F53;&#x65F6;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x901A;&#x914D;&#x7B26;&#x8BC1;&#x4E66;&#x6CA1;&#x80FD;&#x7528;&#x8D77;&#x6765;&#x2026;&#x2026;&#xFF09;&#x3002;</p><p>&#x5176;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x81EA;&#x7528;&#x670D;&#x52A1;&#x662F;freshrss&#xFF0C;&#x4ECA;&#x5929;&#x8BBF;&#x95EE;&#x65F6;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x8BC1;&#x4E66;&#x8FC7;&#x671F;&#x4E86;&#xFF0C;&#x6309;&#x8BF4;acme&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x7EED;&#x671F;&#x7684;&#x3002;&#x67E5;&#x4E86;&#x4E00;&#x4E0B;<code>acme.sh.log</code>&#xFF0C;&#x62A5;&#x4E86;&#x4E00;&#x6761;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF1A;</p><a id="more"></a><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">[Mon Aug 24 00:09:56 CST 2020] yousite.xyz:Verify error:Invalid response from https://yousite.xyz/.well-known/acme-challenge/xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx [*.*.*.*]: 404</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x8BF4;&#x660E;acme&#x662F;&#x6709;&#x5728;&#x81EA;&#x52A8;&#x53BB;&#x66F4;&#x65B0;&#x8BC1;&#x4E66;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5230;verify&#x8FD9;&#x4E00;&#x6B65;&#x65F6;&#x4F1A;&#x901A;&#x4E0D;&#x8FC7;&#x3002;&#x67E5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53D1;&#x73B0;&#x9879;&#x76EE;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x6761;issue&#xFF1A;<a href="https://github.com/acmesh-official/acme.sh/issues/132" target="_blank" rel="noopener" title="Verify error:Invalid response #132">Verify error:Invalid response #132</a>&#x91CC;&#x6709;&#x89E3;&#x7B54;&#xFF1A;</p><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line">&#x540C;&#x6837;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x662F;nginx&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x8BBF;&#x95EE;&#xFF0C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;2&#x4E2A;&#xFF0C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x83B7;&#x53D6;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF1A;</span><br><span class="line"></span><br><span class="line">1.&#x5728;include *.conf; &#x4E0B;&#x65B9;&#x52A0;&#x5165;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#xFF1A;</span><br><span class="line"></span><br><span class="line">server {</span><br><span class="line"></span><br><span class="line">listen 80;</span><br><span class="line"></span><br><span class="line">server_name yoursite.com www.yoursite.com;</span><br><span class="line"></span><br><span class="line">include *.conf;      // &#x52A0;&#x5165;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1B;</span><br><span class="line"></span><br><span class="line">       location ^~ /.well-known/acme-challenge/ </span><br><span class="line">    {</span><br><span class="line">        default_type &quot;text/plain&quot;;</span><br><span class="line">        root  /home/wwwroot/yoursite;</span><br><span class="line">    }</span><br><span class="line">    </span><br><span class="line">    location = /.well-known/acme-challenge/ </span><br><span class="line">    {</span><br><span class="line">        try_files $uri =404;</span><br><span class="line">    }</span><br><span class="line">    </span><br><span class="line"></span><br><span class="line">2.&#x5728; yoursite.conf &#x4E2D;&#xFF0C;&#x628A;&#x62D2;&#x7EDD;&#x8BBF;&#x95EE;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x6389;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</span><br><span class="line"></span><br><span class="line">        #  location ~ /\.</span><br><span class="line">        #  {</span><br><span class="line">        #      deny all;</span><br><span class="line">        #  }</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x6211;&#x7684;nginx&#x628A;&#x5404;&#x670D;&#x52A1;&#x7684;&#x914D;&#x7F6E;&#x5355;&#x72EC;&#x653E;&#x5728;&#x4E86;&#x65B0;&#x5EFA;&#x7684;<code>\etc\nginx\conf\conf.d\xxx.conf</code>&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;<code>location</code>&#x90E8;&#x5206;&#x8981;&#x653E;&#x5230;<code>xxx.conf</code>&#x4E0B;&#xFF0C;&#x540E;&#x7EED;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;nginx&#x7684;&#x914D;&#x7F6E;&#xFF1A;</p><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">cd /etc/nginx/sbin</span><br><span class="line">./nginx -s reload</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x4E3A;&#x4E86;&#x9A8C;&#x8BC1;&#x914D;&#x7F6E;&#x662F;&#x5426;&#x751F;&#x6548;&#xFF0C;&#x8FD9;&#x91CC;&#x66F4;&#x65B0;&#x4E86;&#x4E00;&#x4E0B;acme&#x4E4B;&#x540E;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x8BC1;&#x4E66;&#x624B;&#x52A8;&#x66F4;&#x65B0;&#x3002;</p><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">cd ~/.acme.sh/</span><br><span class="line">acme.sh --upgrade</span><br><span class="line">acme.sh --renew  -d domain.com</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x8FD9;&#x6B21;&#x7B7E;&#x53D1;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x6C34;&#x4E86;&#x4E00;&#x8D34;&#xFF08;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x505A;&#x4E86;&#x8131;&#x654F;&#x5904;&#x7406;&#xFF09;&#x2026;&#x2026;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x4E4B;&amp;#x524D;&amp;#x5728;hostdare&amp;#x8D2D;&amp;#x5165;&amp;#x8FC7;&amp;#x4E00;&amp;#x53F0;VPS&amp;#xFF0C;&amp;#x901F;&amp;#x5EA6;&amp;#x4E00;&amp;#x822C;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x62FF;&amp;#x6765;&amp;#x505A;&amp;#x5907;&amp;#x80CE;&amp;#xFF0C;&amp;#x4E71;&amp;#x4E03;&amp;#x516B;&amp;#x7CDF;&amp;#x90E8;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#x670D;&amp;#x52A1;&amp;#x5728;&amp;#x4E0A;&amp;#x9762;&amp;#xFF0C;&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x6700;&amp;#x4F4E;&amp;#x9650;&amp;#x5EA6;&amp;#x7684;&amp;#x5B89;&amp;#x5168;&amp;#xFF0C;&amp;#x7528;acme&amp;#x7ED9;&amp;#x6BCF;&amp;#x4E2A;&amp;#x670D;&amp;#x52A1;&amp;#x90FD;&amp;#x624B;&amp;#x52A8;&amp;#x751F;&amp;#x6210;&amp;#x4E86;&amp;#x4E00;&amp;#x904D;&amp;#x8BC1;&amp;#x4E66;&amp;#xFF0C;&amp;#x8FD8;&amp;#x633A;&amp;#x9EBB;&amp;#x70E6;&amp;#x7684;&amp;#xFF08;&amp;#x5F53;&amp;#x65F6;&amp;#x56E0;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E9B;&amp;#x539F;&amp;#x56E0;&amp;#xFF0C;&amp;#x901A;&amp;#x914D;&amp;#x7B26;&amp;#x8BC1;&amp;#x4E66;&amp;#x6CA1;&amp;#x80FD;&amp;#x7528;&amp;#x8D77;&amp;#x6765;&amp;#x2026;&amp;#x2026;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4E2D;&amp;#x6700;&amp;#x5E38;&amp;#x7528;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x81EA;&amp;#x7528;&amp;#x670D;&amp;#x52A1;&amp;#x662F;freshrss&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x8BBF;&amp;#x95EE;&amp;#x65F6;&amp;#x7A81;&amp;#x7136;&amp;#x53D1;&amp;#x73B0;&amp;#x8BC1;&amp;#x4E66;&amp;#x8FC7;&amp;#x671F;&amp;#x4E86;&amp;#xFF0C;&amp;#x6309;&amp;#x8BF4;acme&amp;#x662F;&amp;#x53EF;&amp;#x4EE5;&amp;#x81EA;&amp;#x52A8;&amp;#x7EED;&amp;#x671F;&amp;#x7684;&amp;#x3002;&amp;#x67E5;&amp;#x4E86;&amp;#x4E00;&amp;#x4E0B;&lt;code&gt;acme.sh.log&lt;/code&gt;&amp;#xFF0C;&amp;#x62A5;&amp;#x4E86;&amp;#x4E00;&amp;#x6761;&amp;#x8FD9;&amp;#x4E2A;&amp;#x9519;&amp;#x8BEF;&amp;#xFF1A;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="coding" scheme="http://mykonakona.github.io/categories/coding/"/>
    
    
      <category term="VPS" scheme="http://mykonakona.github.io/tags/VPS/"/>
    
  </entry>
  
  <entry>
    <title>我搭静态博客</title>
    <link href="http://mykonakona.github.io/2020/05/27/the-way-I-build-a-static-blog/"/>
    <id>http://mykonakona.github.io/2020/05/27/the-way-I-build-a-static-blog/</id>
    <published>2020-05-27T13:59:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x5176;&#x5B9E;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x5F88;&#x5438;&#x5F15;&#x6211;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E0D;&#x4E45;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x81EA;&#x5DF1;&#x7684;VPS&#x4E0A;&#x642D;&#x5EFA;&#x4E86;&#x6700;&#x8FD1;&#x6BD4;&#x8F83;&#x706B;&#x7684;halo&#x3002;&#x57DF;&#x540D;&#x3001;&#x8BC1;&#x4E66;&#x7B7E;&#x53D1;&#x3001;&#x53CD;&#x4EE3;&#x7684;&#x914D;&#x7F6E;&#x7B49;&#x7B49;&#x90FD;&#x505A;&#x597D;&#x4E86;&#x3002;&#x4F46;&#x7ECF;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6298;&#x817E;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x56DE;&#x6765;&#x91CD;&#x65B0;&#x4F7F;&#x7528;github page&#x3002;</p><p>&#x505A;&#x51FA;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7406;&#x7531;&#x2014;&#x2014;&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x771F;&#x7684;&#x8D35;&#xFF1A;&#x597D;&#x7684;&#x57DF;&#x540D;&#x9700;&#x8981;&#x94B1;&#xFF0C;&#x7EBF;&#x8DEF;&#x6D41;&#x7545;&#x7684;VPS&#x4E5F;&#x9700;&#x8981;&#x94B1;&#x3002;&#x5EC9;&#x4EF7;VPS&#x670D;&#x52A1;&#x5546;&#x7684;&#x7EBF;&#x8DEF;&#x4E00;&#x8A00;&#x96BE;&#x5C3D;&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x7684;&#x4E5F;&#x4EC5;&#x6B62;&#x4E8E;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x548C;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x66F4;&#x5927;&#x7684;&#x91CE;&#x5FC3;&#x3002;&#x56E0;&#x6B64;&#x6743;&#x8861;&#x4E0B;&#x6765;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6027;&#x4EF7;&#x6BD4;&#x7684;&#x65B9;&#x6848;&#x3002;</p><a id="more"></a><p>&#x8BDD;&#x867D;&#x5982;&#x6B64;&#xFF0C;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x5C31;&#x5B8C;&#x7F8E;&#x65E0;&#x7F3A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4E00;&#x4E9B;&#x5728;&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x4E2D;&#x6839;&#x672C;&#x4E0D;&#x80FD;&#x79F0;&#x4E4B;&#x4E3A;&#x95EE;&#x9898;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x4E0A;&#x5C31;&#x5F97;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x201C;&#x5947;&#x6280;&#x6DEB;&#x5DE7;&#x201D;&#x6765;&#x89E3;&#x51B3;&#x3002;</p><p>&#x56E0;&#x6B64;&#x672C;&#x6587;&#x57FA;&#x4E8E;hexo&#x804A;&#x4E00;&#x804A;&#x5728;&#x642D;&#x5EFA;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x70B9;&#xFF0C;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x751F;&#x6210;&#x5668;&#x5982;pelican&#x5728;&#x4F7F;&#x7528;&#x4E2D;&#x57FA;&#x672C;&#x4E0A;&#x56F4;&#x7ED5;&#x7684;&#x4E5F;&#x90FD;&#x662F;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p><h2 id="&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;"><a href="#&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;" class="headerlink" title="&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;"></a>&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;</h2><p>&#x73B0;&#x5728;&#x6D41;&#x884C;&#x7684;&#x505A;&#x6CD5;&#x901A;&#x8FC7;Travis CI&#x81EA;&#x52A8;&#x90E8;&#x7F72;github page&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x9075;&#x5FAA;&#x5982;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;</p><ol><li><p>&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;<code>username.github.io</code>&#x4ED3;&#x5E93;&#xFF0C;&#x5728;github&#x7684;<code>Settings - Developer settings - Personal access tokens</code>&#x9875;&#x9762;&#x5185;&#x4E3A;Travis CI&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;github page&#x4E13;&#x7528;&#xFF0C;&#x5E76;&#x8D4B;&#x4E88;repo&#x6743;&#x9650;&#x7684;access token&#xFF1B;</p></li><li><p>&#x4F7F;&#x7528;github&#x8D26;&#x53F7;&#x767B;&#x9646;Travis CI&#x4EE5;&#x5B8C;&#x6210;&#x8D26;&#x53F7;&#x5173;&#x8054;&#xFF0C;&#x5C06;access token&#x4F5C;&#x4E3A;<code>GH_TOKEN</code>&#x52A0;&#x5165;&#x5230;&#x4ECE;github&#x540C;&#x6B65;&#x8FC7;&#x53BB;&#x7684;&#x4ED3;&#x5E93;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5E76;&#x5728;Travis CI&#x4E2D;&#x542F;&#x7528;&#x8BE5;&#x4ED3;&#x5E93;&#x3002;</p></li><li><p>&#x5728;&#x672C;&#x5730;&#x5B89;&#x88C5;npm&#x3001;hexo&#x3002;&#x521D;&#x59CB;&#x5316;hexo&#x9879;&#x76EE;&#x540E;&#xFF0C;&#x4E3A;&#x672C;&#x5730;&#x9879;&#x76EE;&#x6DFB;&#x52A0;.travis.yml&#xFF0C;&#x5E76;&#x5B8C;&#x6210;_config.yml&#x3001;.gitignore&#x7B49;&#x76F8;&#x5173;&#x914D;&#x7F6E;&#xFF1B;</p></li><li><p>&#x4E3A;<code>username.github.io</code>&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;<code>source</code>&#x5206;&#x652F;&#xFF0C;&#x5C06;&#x672C;&#x5730;&#x9879;&#x76EE;&#x63A8;&#x9001;&#x5230;&#x8FD9;&#x4E2A;source&#x5206;&#x652F;&#x4E0B;&#x3002;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x662F;&#x8BA9;Travis CI&#x6839;&#x636E;source&#x5206;&#x652F;&#x4E0B;.travis.yml&#x4E2D;&#x7684;&#x8BBE;&#x7F6E;&#x7684;&#x6B65;&#x9AA4;&#x751F;&#x6210;&#x9759;&#x6001;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x628A;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x63A8;&#x9001;&#x5230;<code>username.github.io</code>&#x7684;<code>master</code>&#x5206;&#x652F;&#x4E0B;&#x3002;</p></li></ol><p>&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x6559;&#x7A0B;&#x5176;&#x5B9E;&#x76F8;&#x5F53;&#x591A;&#x4E86;&#xFF0C;&#x5982;<a href="https://segmentfault.com/a/1190000021987832" target="_blank" rel="noopener" title="Travis CI &#x52A0; Hexo &#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x6784;&#x5EFA;&#x90E8;&#x7F72; Github Pages &#x535A;&#x5BA2;">1</a>&#x3002;&#x5728;&#x5B9E;&#x9645;&#x642D;&#x5EFA;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x7167;&#x642C;&#x6559;&#x7A0B;&#x3002;</p><h2 id="&#x4E3B;&#x9898;&#x5F00;&#x53D1;"><a href="#&#x4E3B;&#x9898;&#x5F00;&#x53D1;" class="headerlink" title="&#x4E3B;&#x9898;&#x5F00;&#x53D1;"></a>&#x4E3B;&#x9898;&#x5F00;&#x53D1;</h2><p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x53C8;&#x5E0C;&#x671B;&#x505A;&#x4E00;&#x4E9B;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x5B9A;&#x5236;&#xFF0C;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;fork&#x5230;&#x81EA;&#x5DF1;&#x7684;github&#x8D26;&#x53F7;&#x4E0B;&#x3002;&#x5E76;&#x5728;&#x672C;&#x5730;&#x73AF;&#x5883;&#x4E2D;&#x62C9;&#x53D6;fork&#x7684;&#x4E3B;&#x9898;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x4E4B;&#x540E;&#xFF0C;&#x672C;&#x5730;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x5C06;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x4ED3;&#x5E93;&#xFF1A;</p><ul><li><p><code>username.github.io</code>&#x7684;<code>source</code>&#x5206;&#x652F;</p></li><li><p><code>hexo-theme-themename</code>&#x7684;<code>master</code>&#x5206;&#x652F;</p></li></ul><p>&#x7531;&#x4E8E;&#x4E3B;&#x9898;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x5206;&#x652F;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x81EA;&#x52A8;&#x90E8;&#x7F72;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x628A;<code>source</code>&#x4E0B;&#x7684;themes&#x6587;&#x4EF6;&#x5939;&#x52A0;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x7684;<code>.gitignore</code>&#x91CC;&#x53BB;&#xFF0C;&#x907F;&#x514D;&#x53D1;&#x751F;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x7684;&#x4FEE;&#x6539;&#x51B2;&#x7A81;&#x3002;</p><p>&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5219;&#x901A;&#x8FC7;&#x5728;.travis.yml&#x6DFB;&#x52A0;<code>git clone</code>&#x547D;&#x4EE4;&#x5F15;&#x5165;&#x4E3B;&#x9898;&#x5E76;&#x6E32;&#x67D3;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">before_script:</span><br><span class="line">  - npm install -g hexo-cli </span><br><span class="line">  - mkdir themes</span><br><span class="line">  - git clone https://github.com/username/hexo-theme-themename.git themes/themename</span><br><span class="line"></span><br><span class="line">script: </span><br><span class="line">  - hexo generate</span><br></pre></td></tr></tbody></table></figure><p></p><h2 id="&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#x9009;&#x578B;"><a href="#&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#x9009;&#x578B;" class="headerlink" title="&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#x9009;&#x578B;"></a>&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#x9009;&#x578B;</h2><p>&#x5BF9;&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x5C5E;&#x4E8E;&#x6807;&#x914D;&#x7684;&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#xFF0C;&#x5728;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x4E0A;&#x5C31;&#x5F97;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x5947;&#x5947;&#x602A;&#x602A;&#x7684;&#x65B9;&#x6848;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x5F80;&#x5F80;&#x8FD8;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002;&#x6211;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x9898;minos&#x652F;&#x6301;&#x7684;&#x51E0;&#x79CD;&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#xFF0C;&#x5C31;&#x5404;&#x81EA;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#xFF1A;</p><h3 id="disqus"><a href="#disqus" class="headerlink" title="disqus"></a>disqus</h3><p>&#x56FD;&#x5185;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x8BBF;&#x95EE;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x975E;&#x5E38;&#x5F71;&#x54CD;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x3002;</p><ul><li><p>&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x628A;disqus&#x9690;&#x85CF;&#x5728;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x4E2D;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x7528;&#x6237;&#x53EA;&#x6709;&#x5728;&#x70B9;&#x51FB;&#x8BE5;&#x8BC4;&#x8BBA;&#x6309;&#x94AE;&#x540E;&#x624D;&#x4F1A;&#x52A0;&#x8F7D;disqus&#xFF0C;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x6CBB;&#x6807;&#x4E0D;&#x6CBB;&#x672C;&#x7684;&#x65B9;&#x6848;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x575A;&#x6301;&#x4F7F;&#x7528;disqus&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x53C2;&#x8003;<a href="https://blog.skk.moe/post/prevent-disqus-from-slowing-your-site/#Disqus-Lazyload" target="_blank" rel="noopener" title="&#x4F7F; Disqus &#x4E0D;&#x518D;&#x62D6;&#x7D2F;&#x6027;&#x80FD;&#x548C;&#x9875;&#x9762;&#x52A0;&#x8F7D;">2</a>&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x62D6;&#x6162;&#x3002;</p></li></ul><h3 id="gitment-gitalk"><a href="#gitment-gitalk" class="headerlink" title="gitment/gitalk"></a>gitment/gitalk</h3><p>&#x5355;&#x72EC;&#x4E3A;&#x8FD9;&#x7C7B;&#x8BC4;&#x8BBA;&#x670D;&#x52A1;&#x5EFA;&#x4E00;&#x4E2A;&#x5B58;&#x653E;issue&#x4ED3;&#x5E93;&#x5012;&#x8FD8;&#x4E0D;&#x662F;&#x6700;&#x9EBB;&#x70E6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6700;&#x9EBB;&#x70E6;&#x7684;&#x662F;&#x6BCF;&#x7BC7;&#x535A;&#x6587;&#x597D;&#x50CF;&#x90FD;&#x5F97;&#x624B;&#x52A8;&#x52A0;issue&#xFF0C;&#x867D;&#x7136;github&#x4E5F;&#x6709;&#x7F51;&#x53CB;&#x5199;&#x4E86;&#x811A;&#x672C;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x6613;&#x7528;&#x6027;&#x8FD8;&#x662F;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x3002;</p><p>&#x53E6;&#x5916;gitment&#x5DF2;&#x7ECF;&#x505C;&#x6B62;&#x66F4;&#x65B0;&#xFF0C;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x5982;<a href="https://github.com/imsun/gitment/issues/100" target="_blank" rel="noopener" title="&#x603B;&#x662F;&#x63D0;&#x793A; [object XMLHttpRequestProgressEvent] #100">object XMLHttpRequestProgressEvent</a>&#x3001;<a href="https://github.com/imsun/gitment/issues/178" target="_blank" rel="noopener" title="hexo&#x535A;&#x5BA2;&#x7684;gitment&#x8BC4;&#x8BBA;&#x5F00;&#x542F;&#x4E00;&#x76F4;&#x5931;&#x8D25;">hexo&#x4E0A;&#x7684;&#x5F00;&#x542F;&#x5931;&#x8D25;</a>&#x7B49;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7F51;&#x53CB;&#x63D0;&#x4F9B;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x6848;&#x52A0;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E5F;&#x5341;&#x5206;&#x529D;&#x9000;&#x6211;&#x3002;</p><h3 id="isso"><a href="#isso" class="headerlink" title="isso"></a>isso</h3><p>&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x6700;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x9009;&#x7528;&#x4ED6;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x6D89;&#x53CA;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x5FF5;&#x95EE;&#x9898;&#xFF1A;isso&#x9700;&#x8981;&#x81EA;&#x884C;&#x642D;&#x5EFA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53C8;&#x5F97;&#x653E;&#x5728;VPS&#x4E0A;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x76F4;&#x63A5;&#x9009;&#x7528;&#x4E00;&#x4E2A;&#x81EA;&#x5E26;&#x8BC4;&#x8BBA;&#x7684;&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x65B9;&#x6848;&#x5462;&#xFF0C;&#x548C;&#x6211;&#x642D;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x76F8;&#x77DB;&#x76FE;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x4ECB;&#x610F;&#x8FD9;&#x70B9;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x8FD8;&#x662F;&#x63A8;&#x8350;&#x7684;&#x3002;</p><h3 id="valine"><a href="#valine" class="headerlink" title="valine"></a>valine</h3><p>&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x4E0A;&#x90E8;&#x7F72;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6CA1;&#x6709;&#x4E0A;&#x9762;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6076;&#x5FC3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;leancloud&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x80FD;&#x575A;&#x6301;&#x591A;&#x4E45;&#x662F;&#x6BD4;&#x8F83;&#x8BA9;&#x6211;&#x62C5;&#x5FC3;&#x7684;&#x5730;&#x65B9;&#x2026;&#x2026;</p><p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7684;&#x8BC4;&#x8BBA;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x5927;&#x75DB;&#x70B9;&#x3002;&#x867D;&#x7136;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x59CB;&#x7EC8;&#x53EA;&#x80FD;&#x7B97;&#x9A6C;&#x9A6C;&#x864E;&#x864E;&#x80FD;&#x7528;&#xFF0C;&#x96BE;&#x4EE5;&#x8FBE;&#x5230;&#x52A8;&#x6001;&#x535A;&#x5BA2;&#x7684;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x3002;</p><h2 id="&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6536;&#x5F55;&#x53CA;SEO&#x4F18;&#x5316;"><a href="#&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6536;&#x5F55;&#x53CA;SEO&#x4F18;&#x5316;" class="headerlink" title="&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6536;&#x5F55;&#x53CA;SEO&#x4F18;&#x5316;"></a>&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6536;&#x5F55;&#x53CA;SEO&#x4F18;&#x5316;</h2><p>&#x76EE;&#x524D;google&#x7684;&#x7F51;&#x5740;&#x524D;&#x7F00;&#x6536;&#x5F55;&#x7684;&#x63A8;&#x8350;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x6821;&#x9A8C;html&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x6B65;&#x9AA4;&#x53EF;&#x53C2;&#x8003;<a href="https://kennyliblog.nctu.me/2019/06/24/Google-search-Hexo-Blog/" target="_blank" rel="noopener" title="&#x5BE6;&#x4F5C; - &#x8B93; Google &#x80FD;&#x641C;&#x5C0B;&#x5230;&#x81EA;&#x5DF1;&#x7684; Hexo Blog">5</a>&#xFF0C;SEO&#x4F18;&#x5316;&#x65B9;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x4E5F;&#x5F88;&#x591A;&#xFF0C;&#x5982;<a href="https://juejin.im/post/5ae7fc18518825672565a7f0#heading-4" target="_blank" rel="noopener" title="Hexo &#x4E2A;&#x4EBA;&#x535A;&#x5BA2; SEO &#x4F18;&#x5316;&#xFF08;3&#xFF09;&#xFF1A;&#x6539;&#x9020;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x63D0;&#x5347;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6392;&#x540D;">6</a>&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x4E86;&#x3002;</p><h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x76F8;&#x5F53;&#x4E8E;&#x62E5;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x540E;&#x7EED;&#x5305;&#x62EC;<a href="https://dengcb.com/zh/hexo-minos-multi-language/" target="_blank" rel="noopener" title="&#x7528;Minos&#x642D;&#x5EFA;Hexo&#x5168;&#x7AD9;&#x591A;&#x8BED;&#x8A00;&#x7AD9;&#x70B9;">&#x5168;&#x7AD9;&#x591A;&#x8BED;&#x8A00;&#x652F;&#x6301;</a>&#x3001;<a href="https://blog.skk.moe/post/img-lazyload-hexo/" target="_blank" rel="noopener" title="&#x56FE;&#x7247; lazyload &#x7684;&#x5B66;&#x95EE;&#x548C;&#x5728; Hexo &#x4E0A;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;">&#x56FE;&#x7247;&#x61D2;&#x52A0;&#x8F7D;</a>&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x4F18;&#x5316;&#x7684;&#x65B9;&#x9762;&#x3002;</p><p>&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6C38;&#x8FDC;&#x662F;&#x5185;&#x5BB9;&#x3002;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x88AB;&#x5404;&#x79CD;&#x82B1;&#x4FCF;&#x7684;&#x6280;&#x5DE7;&#x8499;&#x853D;&#x4E86;&#x53CC;&#x773C;&#xFF0C;&#x4E3A;&#x4E86;&#x642D;&#x535A;&#x5BA2;&#x800C;&#x642D;&#x535A;&#x5BA2;&#x3002;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x642D;&#x535A;&#x5BA2;&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x548C;&#x52A8;&#x624B;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#x4E0B;&#xFF0C;&#x7EE7;&#x7EED;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x4E0E;&#x521B;&#x610F;&#x1F601;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x52A8;&amp;#x6001;&amp;#x535A;&amp;#x5BA2;&amp;#x5176;&amp;#x5B9E;&amp;#x4E00;&amp;#x76F4;&amp;#x4EE5;&amp;#x6765;&amp;#x90FD;&amp;#x5F88;&amp;#x5438;&amp;#x5F15;&amp;#x6211;&amp;#x3002;&amp;#x4E8B;&amp;#x5B9E;&amp;#x4E0A;&amp;#x4E0D;&amp;#x4E45;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x6211;&amp;#x8FD8;&amp;#x5728;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;VPS&amp;#x4E0A;&amp;#x642D;&amp;#x5EFA;&amp;#x4E86;&amp;#x6700;&amp;#x8FD1;&amp;#x6BD4;&amp;#x8F83;&amp;#x706B;&amp;#x7684;halo&amp;#x3002;&amp;#x57DF;&amp;#x540D;&amp;#x3001;&amp;#x8BC1;&amp;#x4E66;&amp;#x7B7E;&amp;#x53D1;&amp;#x3001;&amp;#x53CD;&amp;#x4EE3;&amp;#x7684;&amp;#x914D;&amp;#x7F6E;&amp;#x7B49;&amp;#x7B49;&amp;#x90FD;&amp;#x505A;&amp;#x597D;&amp;#x4E86;&amp;#x3002;&amp;#x4F46;&amp;#x7ECF;&amp;#x8FC7;&amp;#x4E00;&amp;#x7CFB;&amp;#x5217;&amp;#x7684;&amp;#x6298;&amp;#x817E;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x8FD8;&amp;#x662F;&amp;#x56DE;&amp;#x6765;&amp;#x91CD;&amp;#x65B0;&amp;#x4F7F;&amp;#x7528;github page&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x505A;&amp;#x51FA;&amp;#x8FD9;&amp;#x4E2A;&amp;#x51B3;&amp;#x5B9A;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x7406;&amp;#x7531;&amp;#x2014;&amp;#x2014;&amp;#x52A8;&amp;#x6001;&amp;#x535A;&amp;#x5BA2;&amp;#x771F;&amp;#x7684;&amp;#x8D35;&amp;#xFF1A;&amp;#x597D;&amp;#x7684;&amp;#x57DF;&amp;#x540D;&amp;#x9700;&amp;#x8981;&amp;#x94B1;&amp;#xFF0C;&amp;#x7EBF;&amp;#x8DEF;&amp;#x6D41;&amp;#x7545;&amp;#x7684;VPS&amp;#x4E5F;&amp;#x9700;&amp;#x8981;&amp;#x94B1;&amp;#x3002;&amp;#x5EC9;&amp;#x4EF7;VPS&amp;#x670D;&amp;#x52A1;&amp;#x5546;&amp;#x7684;&amp;#x7EBF;&amp;#x8DEF;&amp;#x4E00;&amp;#x8A00;&amp;#x96BE;&amp;#x5C3D;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x76EE;&amp;#x7684;&amp;#x4E5F;&amp;#x4EC5;&amp;#x6B62;&amp;#x4E8E;&amp;#x8BB0;&amp;#x5F55;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x60F3;&amp;#x6CD5;&amp;#x548C;&amp;#x5174;&amp;#x8DA3;&amp;#xFF0C;&amp;#x4E0D;&amp;#x4F1A;&amp;#x6709;&amp;#x66F4;&amp;#x5927;&amp;#x7684;&amp;#x91CE;&amp;#x5FC3;&amp;#x3002;&amp;#x56E0;&amp;#x6B64;&amp;#x6743;&amp;#x8861;&amp;#x4E0B;&amp;#x6765;&amp;#x6211;&amp;#x66F4;&amp;#x503E;&amp;#x5411;&amp;#x4E8E;&amp;#x9009;&amp;#x62E9;&amp;#x4E00;&amp;#x4E2A;&amp;#x5177;&amp;#x6709;&amp;#x6027;&amp;#x4EF7;&amp;#x6BD4;&amp;#x7684;&amp;#x65B9;&amp;#x6848;&amp;#x3002;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="coding" scheme="http://mykonakona.github.io/categories/coding/"/>
    
    
      <category term="hexo" scheme="http://mykonakona.github.io/tags/hexo/"/>
    
  </entry>
  
  <entry>
    <title>Hyper-V使用记录</title>
    <link href="http://mykonakona.github.io/2020/03/31/hyper-v-sucks/"/>
    <id>http://mykonakona.github.io/2020/03/31/hyper-v-sucks/</id>
    <published>2020-03-31T14:53:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x66F4;&#x65B0;&#xFF1A;&#x597D;&#x6D88;&#x606F;&#x662F;&#x84DD;&#x53E0;&#x51FA;&#x4E86;&#x517C;&#x5BB9;Hyper-V&#x7684;&#x7248;&#x672C;&#xFF0C;&#x574F;&#x6D88;&#x606F;&#x662F;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x5728;&#x6211;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x6CA1;&#x7528;&#x8D77;&#x6765;&#x3002;</p><a id="more"></a><h2 id="0-&#x8D77;&#x56E0;"><a href="#0-&#x8D77;&#x56E0;" class="headerlink" title="0. &#x8D77;&#x56E0;"></a>0. &#x8D77;&#x56E0;</h2><p>&#x7EC8;&#x4E8E;&#x5BF9;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x7684;&#x65E7;&#x7B14;&#x8BB0;&#x672C;&#x5230;&#x4E86;&#x5FCD;&#x65E0;&#x53EF;&#x5FCD;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x4E8E;&#x662F;&#x4ECA;&#x5E74;3&#x6708;&#x4EFD;&#x5728;&#x505A;&#x4E86;&#x5404;&#x79CD;&#x8C03;&#x7814;&#x540E;&#x8D2D;&#x5165;&#x4E86;&#x65B0;&#x673A;&#x5668;&#xFF08;Lenove S740, i5 16G&#x7248;&#x672C;&#xFF09;&#x3002;&#x88C5;&#x673A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4E3A;&#x4E86;&#x5077;&#x61D2;&#xFF0C;&#x6253;&#x7B97;&#x76F4;&#x63A5;&#x7528;Win10&#x81EA;&#x5E26;&#x7684;Hyper-V&#x3002;&#x81EA;&#x5DF1;&#x6253;&#x7684;&#x5982;&#x610F;&#x7B97;&#x76D8;&#x662F;&#x53EF;&#x4EE5;&#x7701;&#x5F97;&#x88C5;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x673A;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E5F;&#x80FD;&#x8BD5;&#x4E00;&#x8BD5;&#x597D;&#x4E0D;&#x597D;&#x7528;&#x3002;</p><p>&#x9996;&#x5148;&#xFF0C;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x4E00;&#x4E2A;Win&#x73AF;&#x5883;&#x7684;&#x865A;&#x62DF;&#x673A;&#x53BB;&#x8DD1;&#x4E00;&#x4E9B;&#x56FD;&#x4EA7;&#x6D41;&#x6C13;&#x8F6F;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#x957F;&#x5E74;&#x5728;&#x540E;&#x53F0;&#x6302;&#x4E00;&#x4E2A;QQProtect&#x8FDB;&#x7A0B;&#x7684;QQ&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8003;&#x8651;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;LTSC&#x7248;&#x672C;&#x7684;Win10&#x865A;&#x62DF;&#x673A;&#x3002;</p><p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;Hyper-V&#x7ED9;&#x4E86;&#x7B2C;&#x4E00;&#x4EE3;&#x548C;&#x7B2C;&#x4E8C;&#x4EE3;&#x4E24;&#x79CD;&#x673A;&#x5668;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5982;&#x679C;&#x60F3;&#x4F20;&#x6587;&#x4EF6;&#x5230;&#x7B2C;&#x4E00;&#x4EE3;&#x673A;&#x5668;&#x7684;&#x865A;&#x62DF;&#x673A;&#x91CC;&#xFF0C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x5C40;&#x57DF;&#x7F51;&#x7684;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x597D;&#x50CF;&#x662F;&#x901A;&#x8FC7;&#x7ED9;&#x865A;&#x62DF;&#x673A;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#x5206;&#x4E00;&#x7247;&#x865A;&#x62DF;&#x786C;&#x76D8;&#x7684;&#x5206;&#x533A;&#xFF0C;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x76F8;&#x5BF9;&#x7E41;&#x7410;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x8BBE;&#x7F6E;&#x3002;&#x6240;&#x4EE5;&#x9664;&#x975E;&#x9700;&#x8981;&#x7528;&#x4E00;&#x4E9B;&#x65E7;&#x5F0F;&#x9A71;&#x52A8;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x7B2C;&#x4E8C;&#x4EE3;&#x673A;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8C;&#x4EE3;&#x673A;&#x5668;&#x652F;&#x6301;&#x589E;&#x5F3A;&#x5BF9;&#x8BDD;&#xFF0C;&#x62F7;&#x8D1D;&#x6587;&#x4EF6;&#x4F1A;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x4E14;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x3002;</span><br></pre></td></tr></tbody></table></figure><p></p><h2 id="1-&#x7B2C;&#x4E00;&#x4E2A;&#x5751;"><a href="#1-&#x7B2C;&#x4E00;&#x4E2A;&#x5751;" class="headerlink" title="1. &#x7B2C;&#x4E00;&#x4E2A;&#x5751;"></a>1. &#x7B2C;&#x4E00;&#x4E2A;&#x5751;</h2><p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x88C5;&#x7CFB;&#x7EDF;&#x5230;&#x65B0;&#x5EFA;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x865A;&#x62DF;&#x7684;DVD&#x5149;&#x9A71;&#x52A0;&#x8F7D;&#x4ECE;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x5F97;&#x5230;&#x7684;&#x955C;&#x50CF;&#x6587;&#x4EF6;&#xFF08;ISO&#x3001;DMG&#x7B49;&#xFF09;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#x3002;&#x53EA;&#x8981;&#x5728;&#x5EFA;&#x865A;&#x62DF;&#x673A;&#x65F6;&#x52FE;&#x9009;&#x4E0A;&#x4F7F;&#x7528;&#x955C;&#x50CF;&#x5B89;&#x88C5;&#x7684;&#x9009;&#x9879;&#x5E76;&#x9009;&#x597D;&#x955C;&#x50CF;&#xFF0C;Hyper-V&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x628A;DVD&#x8BBE;&#x5907;&#x7684;&#x542F;&#x52A8;&#x987A;&#x5E8F;&#x653E;&#x5728;&#x7B2C;&#x4E00;&#x4F4D;&#xFF08;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x673A;&#x8F6F;&#x4EF6;VMWare/VirtualBox&#x4E00;&#x822C;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x5B89;&#x88C5;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;Win10 LTSC&#x65F6;&#xFF0C;Hyper-V&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x5B89;&#x88C5;&#x754C;&#x9762;&#xFF0C;&#x800C;&#x662F;&#x663E;&#x793A;&#x63D0;&#x793A;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#x7684;&#x9875;&#x9762;&#xFF1A;<br></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">scsi dvd the boot loader failed</span><br></pre></td></tr></tbody></table></figure><p></p><p>&#x8FD9;&#x8BF4;&#x660E;&#x901A;&#x8FC7;DVD&#x542F;&#x52A8;&#x5931;&#x8D25;&#xFF0C;&#x6CA1;&#x6CD5;&#x8FDB;&#x5165;&#x955C;&#x50CF;&#x7684;&#x5B89;&#x88C5;&#x754C;&#x9762;&#x3002;&#x4F46;&#x672C;&#x6765;&#x8FD9;&#x4E2A;DVD&#x5149;&#x9A71;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x8BBE;&#x5907;&#xFF0C;&#x6B63;&#x5E38;&#x6765;&#x8BF4;&#x662F;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p><p>google&#x4E86;&#x534A;&#x5929;&#x624D;&#x77E5;&#x9053;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x5728;&#x865A;&#x62DF;&#x673A;&#x5F00;&#x673A;&#x7684;&#x65F6;&#x5019;&#x7528;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x6309;enter&#x952E;&#x624D;&#x80FD;&#x8FDB;&#x5165;&#x7CFB;&#x7EDF;&#x5B89;&#x88C5;&#x754C;&#x9762;&#xFF08;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x673A;&#x65F6;&#x591A;&#x6309;&#x51E0;&#x6B21;enter&#xFF09;&#x3002;VMWare&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x76F4;&#x63A5;&#x5C31;&#x8FDB;&#x53BB;&#x4E86;&#x2026;&#x2026;</p><h2 id="2-&#x7B2C;&#x4E8C;&#x4E2A;&#x5751;"><a href="#2-&#x7B2C;&#x4E8C;&#x4E2A;&#x5751;" class="headerlink" title="2. &#x7B2C;&#x4E8C;&#x4E2A;&#x5751;"></a>2. &#x7B2C;&#x4E8C;&#x4E2A;&#x5751;</h2><p>&#x9664;&#x4E86;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x73AF;&#x5883;&#x8FD0;&#x884C;&#x4E00;&#x4E9B;&#x6D41;&#x6C13;&#x8F6F;&#x4EF6;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x5C31;&#x662F;&#x7528;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#x770B;&#x9752;&#x4F60;&#x6216;&#x8005;&#x770B;&#x53E3;&#x888B;48&#x76F4;&#x64AD;&#x3002;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x7231;&#x5947;&#x827A;&#x7F51;&#x7AD9;&#x5FC5;&#x987B;&#x6CE8;&#x518C;&#x624D;&#x80FD;&#x770B;&#x5B83;&#x63D0;&#x4F9B;&#x7684;&#x6240;&#x8C13;&#x7684;&#x201C;720P&#x201D;&#x7684;&#x89C6;&#x9891;&#x6E90;&#xFF0C;&#x975E;&#x5E38;&#x6076;&#x5FC3;&#xFF0C;&#x4E3A;&#x4E86;&#x770B;&#x8FD9;&#x4E2A;&#x201C;720P&#x201D;&#x53EA;&#x80FD;&#x91C7;&#x7528;&#x901A;&#x8FC7;&#x6A21;&#x62DF;&#x5668;&#x5230;APP&#x91CC;&#x53BB;&#x770B;&#x3002;&#x5982;&#x679C;&#x6253;&#x5F00;&#x4E86;Hyper-V&#x529F;&#x80FD;&#xFF0C;&#x8BF8;&#x5982;&#x96F7;&#x7535;&#x3001;&#x84DD;&#x53E0;&#x3001;mumu&#x8FD9;&#x7C7B;&#x6A21;&#x62DF;&#x5668;&#x4F1A;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x5E02;&#x9762;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x662F;VitrualBox&#x67B6;&#x6784;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x800C;VitrualBox&#x4F1A;&#x548C;Hyper-V&#x51B2;&#x7A81;&#x3002;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x4E00;&#x822C;&#x4E5F;&#x4F1A;&#x88AB;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x91CC;&#x63D0;&#x5230;&#x8981;&#x5728;Win&#x4E0B;&#x5173;&#x95ED;Hyper-V&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#x3002;</p><p>&#x90A3;&#x6253;&#x5F00;Hyper-V&#x529F;&#x80FD;&#x540E;&#x5C31;&#x6CA1;&#x6CD5;&#x5728;&#x673A;&#x5668;&#x4E0A;&#x5F00;&#x4E00;&#x4E2A;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#x4E86;&#x5417;&#xFF1F;&#x4E5F;&#x662F;&#x6709;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x7684;&#x3002;&#x8981;&#x60F3;&#x5728;Hyper-V&#x4E0B;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x5B89;&#x5353;&#x6A21;&#x62DF;&#x5668;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://developer.android.com/studio/run/emulator-acceleration#vm-windows-whpx" target="_blank" rel="noopener">&#x201C;&#x4F7F;&#x7528; Windows Hypervisor Platform &#x914D;&#x7F6E;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x901F;&#x201D;</a>&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x662F;&#x901A;&#x8FC7;&#x5B89;&#x88C5;Android Studio(<a href="https://blog.csdn.net/chen_z_p/article/details/102637956" target="_blank" rel="noopener">&#x56FD;&#x5185;&#x9700;&#x8981;&#x6539;hosts</a>&#xFF09;&#xFF0C;&#x4F7F;&#x7528;IDE&#x81EA;&#x5E26;&#x7684;&#x6A21;&#x62DF;&#x5668;&#x53BB;&#x6A21;&#x62DF;&#x3002;&#x5B9E;&#x6D4B;&#x4E0B;&#x6765;Android Studio&#x7684;&#x8FD9;&#x4E2A;&#x5F00;&#x53D1;&#x7528;&#x6A21;&#x62DF;&#x5668;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x6253;&#x5F00;Hyper-V&#x7684;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x663E;&#x793A;&#x6548;&#x679C;&#x548C;&#x6D41;&#x7545;&#x5EA6;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x5F88;&#x975E;&#x5E38;&#x5403;&#x914D;&#x7F6E;&#x3002;S740&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;CPU&#x5360;&#x7528;&#x7387;&#x4E00;&#x76F4;&#x662F;100%&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x5230;&#x4E00;&#x5206;&#x949F;&#x673A;&#x5668;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x53D1;&#x70ED;&#x548C;&#x566A;&#x58F0;&#x3002;&#x53EF;&#x80FD;&#x66F4;&#x9AD8;&#x914D;&#x7F6E;&#x7684;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x5728;&#x6211;&#x8FD9;&#x91CC;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5BA3;&#x544A;&#x5931;&#x8D25;&#x3002;</p><h2 id="3-&#x7B2C;&#x4E09;&#x4E2A;&#x5751;&#xFF08;&#x4E25;&#x683C;&#x8BF4;&#x4E0D;&#x662F;Hyper-V&#x7684;&#x9505;&#xFF09;"><a href="#3-&#x7B2C;&#x4E09;&#x4E2A;&#x5751;&#xFF08;&#x4E25;&#x683C;&#x8BF4;&#x4E0D;&#x662F;Hyper-V&#x7684;&#x9505;&#xFF09;" class="headerlink" title="3. &#x7B2C;&#x4E09;&#x4E2A;&#x5751;&#xFF08;&#x4E25;&#x683C;&#x8BF4;&#x4E0D;&#x662F;Hyper-V&#x7684;&#x9505;&#xFF09;"></a>3. &#x7B2C;&#x4E09;&#x4E2A;&#x5751;&#xFF08;&#x4E25;&#x683C;&#x8BF4;&#x4E0D;&#x662F;Hyper-V&#x7684;&#x9505;&#xFF09;</h2><p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6848;&#x662F;Hyper-V&#x4E0A;&#x88C5;Android-x86&#x7684;&#x865A;&#x62DF;&#x673A;&#x3002;&#x8FD9;&#x4E00;&#x65B9;&#x6848;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x7F8E;&#x597D;&#xFF0C;&#x4F46;&#x4F1A;&#x78B0;&#x5230;&#x4E00;&#x4E9B;Android&#x7F16;&#x8BD1;&#x4E0E;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x96BE;&#x5230;&#x4E86;&#x6CA1;&#x6709;&#x5B89;&#x5353;&#x7ECF;&#x9A8C;&#x7684;&#x6211;&#x3002;&#x5728;&#x5B89;&#x88C5;&#x955C;&#x50CF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;android-x86.org&#x4E0A;&#x7684;&#x955C;&#x50CF;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x8BD5;&#x4E86;&#x4E2A;&#x904D;&#xFF0C;&#x6709;&#x4E9B;&#x955C;&#x50CF;&#x4F1A;&#x51FA;&#x73B0;&#x952E;&#x76D8;&#x5931;&#x6548;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6709;&#x4E9B;&#x955C;&#x50CF;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x5B89;&#x88C5;&#xFF0C;&#x4F46;&#x5B89;&#x88C5;&#x5B8C;&#x624B;&#x673A;QQ&#x6216;&#x8005;&#x5FAE;&#x4FE1;&#x5E76;&#x6253;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x5C31;&#x4E00;&#x76F4;&#x5F39;&#x505C;&#x6B62;&#x63D0;&#x793A;&#xFF0C;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;google&#x4E86;&#x4E0B;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x7248;&#x672C;&#x7684;Android-x86&#x955C;&#x50CF;&#x57FA;&#x672C;&#x4E0D;&#x81EA;&#x5E26;houdini&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5BFC;&#x81F4;&#x5FAE;&#x4FE1;&#x3001;qq&#x3001;&#x53E3;&#x888B;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x6CA1;&#x6CD5;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#x3002;</p><p>&#x5B9E;&#x5728;&#x6709;&#x70B9;&#x61D2;&#x5F97;&#x7EE7;&#x7EED;&#x518D;&#x6298;&#x817E;&#x3002;&#x540E;&#x6765;&#x8FD8;&#x8BD5;&#x4E86;&#x8BD5;Win&#x4E0B;&#x7684;docker desktop&#xFF0C;&#x5F88;&#x6D41;&#x7545;&#xFF0C;&#x4F46;&#x611F;&#x89C9;&#x7528;&#x7684;&#x4EBA;&#x8FD8;&#x662F;&#x504F;&#x5C11;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x662F;&#x7528;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x57FA;&#x4E8E;Linux&#x73AF;&#x5883;&#x7684;&#x8BA8;&#x8BBA;&#x4F1A;&#x6BD4;&#x8F83;&#x591A;&#x3002;</p><h2 id="4-&#x5C0F;&#x7ED3;"><a href="#4-&#x5C0F;&#x7ED3;" class="headerlink" title="4. &#x5C0F;&#x7ED3;"></a>4. &#x5C0F;&#x7ED3;</h2><p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x6700;&#x540E;&#x628A;Hyper-V&#x5173;&#x4E86;&#xFF0C;&#x53BB;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;VMWare&#x3002;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x66F4;&amp;#x65B0;&amp;#xFF1A;&amp;#x597D;&amp;#x6D88;&amp;#x606F;&amp;#x662F;&amp;#x84DD;&amp;#x53E0;&amp;#x51FA;&amp;#x4E86;&amp;#x517C;&amp;#x5BB9;Hyper-V&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#xFF0C;&amp;#x574F;&amp;#x6D88;&amp;#x606F;&amp;#x662F;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7248;&amp;#x672C;&amp;#x5728;&amp;#x6211;&amp;#x7684;&amp;#x7535;&amp;#x8111;&amp;#x4E0A;&amp;#x6CA1;&amp;#x7528;&amp;#x8D77;&amp;#x6765;&amp;#x3002;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="coding" scheme="http://mykonakona.github.io/categories/coding/"/>
    
    
      <category term="virtualization" scheme="http://mykonakona.github.io/tags/virtualization/"/>
    
  </entry>
  
  <entry>
    <title>使用用户脚本将Flash播放器替换为HTML5播放器</title>
    <link href="http://mykonakona.github.io/2019/04/29/replace-the-flash-player-with-an-HTML5-player/"/>
    <id>http://mykonakona.github.io/2019/04/29/replace-the-flash-player-with-an-HTML5-player/</id>
    <published>2019-04-29T06:38:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x505A;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x52A8;&#x673A;&#x5176;&#x5B9E;&#x662F;&#x4E3A;&#x4E86;&#x5237;48&#x7684;&#x516C;&#x6F14;&#x76F4;&#x64AD;&#xFF0C;&#x672C;&#x6765;&#x4E00;&#x76F4;&#x5728;b&#x7AD9;&#x4E0A;&#x770B;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x4F46;&#x770B;&#x8FD9;&#x4E2A;&#x6708;&#x7684;n&#x961F;N.E.W&#x516C;&#x6F14;&#x7684;&#x90A3;&#x5929;&#xFF0C;b&#x7AD9;&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#x6CA1;&#x6709;&#x76F4;&#x64AD;&#x6E90;&#x4E86;&#x2026;&#x2026;</p><a id="more"></a><p>&#x4E5F;&#x6765;&#x4E0D;&#x53CA;&#x641E;&#x6E05;&#x695A;&#x6CA1;&#x6709;&#x6E90;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x662F;&#x4E0D;&#x662F;&#x53C8;&#x662F;&#x4E1D;&#x82AD;&#x60F3;&#x641E;&#x95ED;&#x73AF;&#xFF0C;&#x603B;&#x4E4B;&#x5F53;&#x65F6;&#x9664;&#x4E86;&#x6A21;&#x62DF;&#x5668;&#x767B;&#x53E3;&#x888B;&#xFF0C;&#x597D;&#x50CF;&#x7535;&#x8111;&#x4E0A;&#x5237;&#x76F4;&#x64AD;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x53EA;&#x5269;&#x5728;live.48.cn&#x4E0A;&#x770B;&#x3002;</p><p>&#x7136;&#x540E;live48&#x4E0D;&#x51FA;&#x610F;&#x6599;&#x5730;&#x8FD8;&#x5728;&#x7528;flash&#xFF0C;&#x6211;&#x7684;&#x706B;&#x72D0;&#x8FDB;&#x53BB;&#x4E4B;&#x540E;&#x5C31;&#x662F;&#x4E00;&#x5757;&#x767D;&#x677F;&#x3002;&#x867D;&#x7136;&#x6700;&#x540E;&#x4E34;&#x65F6;&#x7528;CentBrowser&#x5237;&#x4E86;&#x4E00;&#x4E0B;&#x516C;&#x6F14;&#xFF0C;&#x4F46;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x4E3B;&#x529B;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5237;&#x5B8C;&#x4E4B;&#x540E;&#x5C31;&#x83AB;&#x540D;&#x5730;&#x611F;&#x89C9;&#x4E0D;&#x723D;&#x2026;&#x2026;</p><p>&#x6252;&#x4E86;&#x6252;greasefork&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x811A;&#x672C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x3002;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x7528;&#x4E86;dplayer&#x7684;&#x811A;&#x672C;<a href="https://greasyfork.org/zh-CN/scripts/378188-dilidili-flash-to-html5-fix" target="_blank" rel="noopener">dilidili flash to html5 fix</a>&#x5F00;&#x59CB;&#x6284;&#x3002;&#x6284;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C31;&#x611F;&#x89C9;&#xFF1A;&#x5982;&#x679C;&#x53EA;&#x8003;&#x8651;&#x6EE1;&#x8DB3;&#x6700;&#x57FA;&#x672C;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x8FD8;&#x5728;&#x4F7F;&#x7528;Flash&#x64AD;&#x653E;&#x5668;&#x7684;&#x89C6;&#x9891;&#x7AD9;&#x90FD;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x901A;&#x8FC7;&#x52A0;&#x8F7D;&#x7528;&#x6237;&#x811A;&#x672C;&#x505A;h5&#x64AD;&#x653E;&#x5668;&#x7684;&#x66FF;&#x6362;&#x3002;</p><h2 id="&#x5F00;&#x59CB;&#xFF1A;"><a href="#&#x5F00;&#x59CB;&#xFF1A;" class="headerlink" title="&#x5F00;&#x59CB;&#xFF1A;"></a>&#x5F00;&#x59CB;&#xFF1A;</h2><ul><li>&#x5728;head&#x6216;&#x8005;body&#x52A0;&#x8F7D;dplayer&#x7684;&#x7C7B;&#x5E93;&#x548C;hls&#x7684;&#x7C7B;&#x5E93;&#x3002;</li><li>&#x89E6;&#x53D1;window.onload&#x540E;&#xFF0C;&#x6E05;&#x7A7A;&#x539F;&#x64AD;&#x653E;&#x5668;div&#x4E0B;&#x7684;&#x5B50;&#x5143;&#x7D20;&#xFF0C;append&#x4E00;&#x4E2A;&#x65B0;div&#x8FDB;&#x53BB;&#x7528;&#x4E8E;&#x65B0;&#x64AD;&#x653E;&#x5668;&#x7684;&#x4F7F;&#x7528;&#x3002;</li><li>&#x5199;&#x4E00;&#x4E2A;dplayer&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x914D;&#x597D;&#x4ECE;&#x539F;&#x9875;&#x9762;&#x63D0;&#x53D6;&#x7684;&#x89C6;&#x9891;url&#x3001;&#x89C6;&#x9891;&#x7C7B;&#x578B;&#x4E3A;hls&#x7B49;&#x914D;&#x7F6E;&#x9879;&#x5373;&#x53EF;&#x3002;</li></ul><p>&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x89C1;<a href="https://greasyfork.org/zh-CN/scripts/382316" target="_blank" rel="noopener">live48 html5 player</a>&#x3002;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x505A;&amp;#x8FD9;&amp;#x4E2A;&amp;#x4E1C;&amp;#x897F;&amp;#x7684;&amp;#x52A8;&amp;#x673A;&amp;#x5176;&amp;#x5B9E;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x5237;48&amp;#x7684;&amp;#x516C;&amp;#x6F14;&amp;#x76F4;&amp;#x64AD;&amp;#xFF0C;&amp;#x672C;&amp;#x6765;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;b&amp;#x7AD9;&amp;#x4E0A;&amp;#x770B;&amp;#x662F;&amp;#x6CA1;&amp;#x6709;&amp;#x95EE;&amp;#x9898;&amp;#x7684;&amp;#x3002;&amp;#x4F46;&amp;#x770B;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6708;&amp;#x7684;n&amp;#x961F;N.E.W&amp;#x516C;&amp;#x6F14;&amp;#x7684;&amp;#x90A3;&amp;#x5929;&amp;#xFF0C;b&amp;#x7AD9;&amp;#x4E0D;&amp;#x77E5;&amp;#x4E3A;&amp;#x4F55;&amp;#x6CA1;&amp;#x6709;&amp;#x76F4;&amp;#x64AD;&amp;#x6E90;&amp;#x4E86;&amp;#x2026;&amp;#x2026;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="coding" scheme="http://mykonakona.github.io/categories/coding/"/>
    
    
      <category term="userscript" scheme="http://mykonakona.github.io/tags/userscript/"/>
    
  </entry>
  
  <entry>
    <title>Hello World</title>
    <link href="http://mykonakona.github.io/2018/05/23/hello-world/"/>
    <id>http://mykonakona.github.io/2018/05/23/hello-world/</id>
    <published>2018-05-23T16:00:00.000Z</published>
    <updated>2020-11-18T11:46:35.023Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>Welcome to <a href="https://hexo.io/" target="_blank" rel="noopener">Hexo</a>! This is your very first post. Check <a href="https://hexo.io/docs/" target="_blank" rel="noopener">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="https://hexo.io/docs/troubleshooting.html" target="_blank" rel="noopener">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="noopener">GitHub</a>.</p><a id="more"></a><h2 id="Quick-Start"><a href="#Quick-Start" class="headerlink" title="Quick Start"></a>Quick Start</h2><h3 id="Create-a-new-post"><a href="#Create-a-new-post" class="headerlink" title="Create a new post"></a>Create a new post</h3><p></p><figure class="highlight bash hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo new <span class="hljs-string">&quot;My New Post&quot;</span></span><br></pre></td></tr></tbody></table></figure><p></p><p>More info: <a href="https://hexo.io/docs/writing.html" target="_blank" rel="noopener">Writing</a></p><h3 id="Run-server"><a href="#Run-server" class="headerlink" title="Run server"></a>Run server</h3><p></p><figure class="highlight bash hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo server</span><br></pre></td></tr></tbody></table></figure><p></p><p>More info: <a href="https://hexo.io/docs/server.html" target="_blank" rel="noopener">Server</a></p><h3 id="Generate-static-files"><a href="#Generate-static-files" class="headerlink" title="Generate static files"></a>Generate static files</h3><p></p><figure class="highlight bash hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo generate</span><br></pre></td></tr></tbody></table></figure><p></p><p>More info: <a href="https://hexo.io/docs/generating.html" target="_blank" rel="noopener">Generating</a></p><h3 id="Deploy-to-remote-sites"><a href="#Deploy-to-remote-sites" class="headerlink" title="Deploy to remote sites"></a>Deploy to remote sites</h3><p></p><figure class="highlight bash hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo deploy</span><br></pre></td></tr></tbody></table></figure><p></p><p>More info: <a href="https://hexo.io/docs/one-command-deployment.html" target="_blank" rel="noopener">Deployment</a></p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;Welcome to &lt;a href=&quot;https://hexo.io/&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;Hexo&lt;/a&gt;! This is your very first post. Check &lt;a href=&quot;https://hexo.io/docs/&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;documentation&lt;/a&gt; for more info. If you get any problems when using Hexo, you can find the answer in &lt;a href=&quot;https://hexo.io/docs/troubleshooting.html&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;troubleshooting&lt;/a&gt; or you can ask me on &lt;a href=&quot;https://github.com/hexojs/hexo/issues&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;GitHub&lt;/a&gt;.&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
    
  </entry>
  
</feed>
