<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>聊聊Yoga S740 - mykonakona</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">




<meta name="description" content="">









<link rel="icon" href="/images/favicon.ico">


<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/bulma/0.6.2/css/bulma.min.css">

<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/highlight.js/9.12.0/styles/atom-one-dark.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">

    
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-dark.min.css">
    

<link rel="stylesheet" href="/css/style.css">

    
<script defer src="https://cdn.bootcdn.net/ajax/libs/font-awesome/5.15.1/js/all.min.js"></script>

<script> loadCSS("https://fonts.loli.net/css?family=Lora|Montserrat|Fira+Mono|Material+Icons")</script>
<link rel="stylesheet" href="https://fonts.loli.net/css?family=Lora|Montserrat|Fira+Mono|Material+Icons" media="all">
<noscript>
    <link rel="stylesheet" href="//fonts.googleapis.com/css?family=Lora|Montserrat|Anonymous+Pro:400|Material+Icons"/>
</noscript>





<meta name="generator" content="Hexo 4.2.1"><link rel="alternate" href="/atom.xml" title="mykonakona" type="application/atom+xml">
</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    mykonakona
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">归档</a>
            
            <a class="navbar-item "
               href="/categories">分类</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="RSS" href="https://mykonakona.github.io/atom.xml">
                
                <i class="fas fa-rss"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            聊聊Yoga S740
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-09-04T14:32:00.000Z" itemprop="datePublished">9月 4 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/life/">life</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            10 分钟 读完 (约 1471 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>Yoga S740&#x4ECE;4&#x6708;&#x4EFD;&#x5165;&#x624B;&#x540E;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4E86;&#x8FD1;5&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x60F3;&#x7B80;&#x5355;&#x804A;&#x804A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x4E0A;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<a id="more"></a>

<p>&#x5728;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x6362;&#x673A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x624B;&#x4E0A;&#x670D;&#x5F79;&#x7684;&#x673A;&#x5668;&#x8FD8;&#x662F;&#x4E00;&#x53F0;13&#x5E74;&#x8D2D;&#x4E70;&#x7684;Dell Vostro&#x7CFB;&#x5217;&#x3002;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x786C;&#x76D8;&#x3001;&#x98CE;&#x6247;&#x751A;&#x81F3;&#x4E8E;&#x952E;&#x76D8;C&#x9762;&#x548C;D&#x58F3;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x6211;&#x6362;&#x4E86;&#x4E2A;&#x904D;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x8FD8;&#x5269;&#x5C4F;&#x5E55;&#x6CA1;&#x6709;&#x52A8;&#x8FC7;&#x3002;&#x4EE5;&#x4E3A;&#x4FEE;&#x4FEE;&#x8865;&#x8865;&#x8FD8;&#x53EF;&#x4EE5;&#x575A;&#x6301;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5728;&#x6570;&#x4E0D;&#x6E05;&#x662F;&#x7B2C;&#x51E0;&#x6B21;&#x6F0F;&#x7535;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x8FD8;&#x662F;&#x53D7;&#x4E0D;&#x4E86;&#x4E86;&#x3002;</p>
<p>&#x51B3;&#x5B9A;&#x8D2D;&#x673A;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x5206;&#x6790;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5927;&#x4F53;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x80FD;&#x505A;&#x4E2D;&#x5EA6;&#x7684;&#x89C6;&#x9891;&#x526A;&#x8F91;&#x548C;&#x6E32;&#x67D3;</li>
<li>&#x53EF;&#x4EE5;&#x73A9;&#x5F97;&#x52A8;&#x6587;&#x660E;6&#x6216;&#x8005;&#x6B27;&#x9646;&#x98CE;&#x4E91;4</li>
<li>&#x5185;&#x5B58;16G&#xFF0C;&#x4FBF;&#x4E8E;&#x5F00;&#x865A;&#x62DF;&#x673A;&#xFF1B;&#x786C;&#x76D8;512G&#x8D77;&#x6B65;</li>
<li>&#x5C4F;&#x5E55;&#x5927;&#x5C0F;&#x5728;14&#x5BF8;&#x4EE5;&#x5185;&#xFF0C;&#x539A;&#x5EA6;&#x5C0F;&#x4E8E;2cm</li>
<li>&#x53EF;&#x4EE5;180&#x5EA6;&#x5F00;&#x5408;</li>
<li>&#x63A5;&#x53E3;&#x4E0D;&#x80FD;&#x592A;&#x7B80;&#x964B;&#xFF0C;&#x5F97;&#x57FA;&#x672C;&#x591F;&#x7528;</li>
<li>&#x8F83;&#x957F;&#x7684;&#x7EED;&#x822A;</li>
<li>&#x4E0D;&#x8981;&#x592A;&#x8D35;&#xFF08;&#x7B11;</li>
<li>&#x2026;&#x2026;</li>
</ul>
<p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#x4E2D;&#x5EA6;&#x7684;&#x89C6;&#x9891;&#x526A;&#x8F91;&#x548C;&#x6E38;&#x620F;&#x90FD;&#x5BF9;CPU&#x6709;&#x4E00;&#x5B9A;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x80FD;&#x592A;&#x83DC;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#x6BCF;&#x6B21;&#x8FD8;&#x5F97;&#x5F00;&#x8FDC;&#x7A0B;&#x8FDE;&#x5BB6;&#x91CC;&#x7684;&#x7535;&#x8111;&#x505A;&#x526A;&#x8F91;&#xFF0C;&#x592A;&#x9EBB;&#x70E6;&#x3002;&#x5185;&#x5B58;16G&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x591A;&#x5F00;&#x51E0;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;14&#x5BF8;&#x4EE5;&#x5185;&#x4E5F;&#x57FA;&#x672C;&#x9650;&#x5B9A;&#x53EA;&#x80FD;&#x5728;&#x8F7B;&#x8584;&#x672C;&#x91CC;&#x6311;&#x3002;180&#x5EA6;&#x5F00;&#x5408;&#x7B97;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x4E00;&#x4E2A;&#x559C;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x644A;&#x5F00;&#x4E4B;&#x540E;&#x63D2;&#x663E;&#x793A;&#x5668;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x5F53;&#x65F6;&#x53EA;&#x662F;&#x5728;&#x8111;&#x6D77;&#x91CC;&#x7C97;&#x7565;&#x5730;&#x5217;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x662F;&#x51B2;&#x7740;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53BB;&#x9009;&#x673A;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x5341;&#x5206;&#x540E;&#x6094;&#xFF0C;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x6362;Macbook Pro&#xFF0C;&#x672C;&#x6765;Win&#x7CFB;&#x5217;&#x672C;&#x4E5F;&#x5DF2;&#x7ECF;&#x7528;&#x5230;&#x6709;&#x70B9;&#x5410;&#x4E86;&#xFF0C;&#x4F46;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x8D70;&#x51FA;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x679C;&#x7136;&#x8FD8;&#x662F;&#x7A77;&#x3002;</p>
<p>&#x5728;&#x5404;&#x79CD;&#x5947;&#x5947;&#x602A;&#x602A;&#x7684;&#x8981;&#x6C42;&#x7684;&#x5F15;&#x5BFC;&#x4E0B;&#x8D70;&#x8FDB;&#x6211;&#x89C6;&#x91CE;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x53F0;S740&#x4E86;&#x3002;&#x5404;&#x79CD;&#x6D4B;&#x8BC4;&#x90FD;&#x6709;&#x63D0;&#x5230;&#x5B83;&#x7684;&#x5404;&#x79CD;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>3733Mhz&#x7684;&#x677F;&#x8F7D;LPDDR4X&#x5185;&#x5B58;&#xFF0C;&#x7B97;&#x662F;&#x5F53;&#x524D;&#x5E02;&#x9762;&#x4E0A;&#x7B14;&#x8BB0;&#x672C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6700;&#x9AD8;&#x9891;&#x5185;&#x5B58;&#x4E86;</li>
<li>&#x4E00;&#x5757;DC&#x8C03;&#x5149;&#x3001;72%NTSC&#x3001;400nits&#x7684;&#x5C4F;&#x5E55;&#xFF0C;&#x7D20;&#x8D28;&#x76F8;&#x5F53;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x5757;&#x5C4F;&#x662F;LTPS&#x7684;&#x4F4E;&#x529F;&#x8017;&#x5C4F;&#xFF0C;&#x642D;&#x914D;62Wh&#x7684;&#x5927;&#x5BB9;&#x91CF;&#x7535;&#x6C60;&#xFF0C;&#x7EED;&#x822A;&#x8868;&#x73B0;&#x5F88;&#x4E0D;&#x9519;</li>
<li>&#x4F7F;&#x7528;10&#x4EE3;CPU&#xFF0C;&#x6027;&#x80FD;&#x91CA;&#x653E;&#x8868;&#x73B0;&#x597D;</li>
<li>&#x6EE1;&#x8840;&#x96F7;&#x7535;3&#x63A5;&#x53E3;&#xFF0C;WiFi6&#x65E0;&#x7EBF;&#x7F51;&#x5361;</li>
</ul>
<p>&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x6709;&#x6CA1;&#x6709;&#x5404;&#x79CD;&#x6D4B;&#x8BC4;&#x8BF4;&#x7684;&#x8FD9;&#x4E48;&#x597D;&#x5462;&#x3002;&#x4ECE;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x611F;&#x53D7;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#x662F;&#x57FA;&#x672C;&#x5C5E;&#x5B9E;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x6CA1;&#x6709;&#x7F3A;&#x70B9;&#x4E86;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x7F3A;&#x70B9;&#x8FD8;&#x4E0D;&#x5C11;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5F88;&#x4E0D;&#x80FD;&#x8BA9;&#x4EBA;&#x5FCD;&#x53D7;&#x4E00;&#x70B9;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;C&#x9762;&#x975E;&#x5E38;&#x7684;&#x5C16;&#x9510;&#xFF0C;&#x63E1;&#x6301;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x673A;&#x5668;&#x7684;&#x952E;&#x76D8;&#x624B;&#x611F;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E9B;&#x6D4B;&#x8BC4;&#x91CC;&#x5439;&#x7684;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x7B97;&#x7279;&#x522B;&#x5DEE;&#xFF0C;&#x4F46;&#x51FB;&#x952E;&#x7684;&#x65F6;&#x5019;&#x6709;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x5361;&#x952E;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x63A5;&#x53E3;&#x5E03;&#x5C40;&#x4E5F;&#x4E0D;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x53F3;&#x8FB9;&#x5355;&#x72EC;&#x653E;&#x4E86;&#x4E00;&#x4E2A;&#x5B64;&#x96F6;&#x96F6;&#x7684;USB&#xFF0C;&#x5DE6;&#x8FB9;&#x628A;&#x7535;&#x6E90;&#x53E3;&#xFF0C;&#x96F7;&#x7535;3&#x63A5;&#x53E3;&#xFF0C;USB&#x53E3;&#x548C;&#x8033;&#x673A;&#x53E3;&#x4E00;&#x80A1;&#x8111;&#x513F;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x5F88;&#x62E5;&#x6324;&#x3002;&#x53EA;&#x914D;&#x4E00;&#x4E2A;Type-C&#x63A5;&#x53E3;&#x4E5F;&#x663E;&#x5F97;&#x5F88;&#x5C0F;&#x6C14;&#xFF0C;&#x591A;&#x914D;&#x4E00;&#x4E2A;&#x628A;&#x7535;&#x6E90;&#x53E3;&#x780D;&#x6389;&#x4E0D;&#x597D;&#x4E48;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x6307;&#x7EB9;&#x89E3;&#x9501;&#x4E5F;&#x662F;&#x8BA9;&#x4EBA;&#x5F88;&#x8D39;&#x89E3;&#x7684;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x559C;&#x6B22;&#x9762;&#x90E8;&#x89E3;&#x9501;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#x4E5F;&#x4E0D;&#x5F97;&#x4E0D;&#x7528;&#x3002;</p>
<p>&#x5728;7&#x6708;&#x4EFD;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6389;&#x76D8;&#x4E86;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;SSD&#x8868;&#x73B0;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x633A;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E48;&#x5FEB;&#x5C31;&#x6389;&#x76D8;&#x5B9E;&#x5728;&#x662F;&#x51FA;&#x4E4E;&#x6211;&#x7684;&#x610F;&#x6599;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x53EA;&#x80FD;&#x8054;&#x7CFB;&#x8054;&#x60F3;&#x4E0A;&#x95E8;&#x7EF4;&#x4FEE;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x60F3;&#x7740;&#x627E;&#x5B83;&#x4EEC;&#x514D;&#x8D39;&#x6362;&#x5757;&#x76D8;&#x3002;</p>
<p>&#x7B49;&#x6765;&#x4E86;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0A;&#x95E8;&#xFF0C;&#x6362;&#x5B8C;&#x786C;&#x76D8;&#x91CD;&#x88C5;&#x4E86;&#x7CFB;&#x7EDF;&#xFF0C;&#x53D1;&#x73B0;&#x89E6;&#x6478;&#x677F;&#x53C8;&#x4E0D;&#x5DE5;&#x4F5C;&#x4E86;&#x2026;&#x2026;&#x4E00;&#x822C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x60F3;&#x7740;&#x53BB;&#x627E;&#x9A71;&#x52A8;&#x88C5;&#x4E0A;&#xFF0C;&#x7ED3;&#x679C;&#x8054;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x627E;&#x4E0D;&#x5230;&#x76F8;&#x5173;&#x7684;&#x9A71;&#x52A8;&#x3002;&#x8FD9;&#x4F4D;&#x8054;&#x60F3;&#x5DE5;&#x7A0B;&#x5E08;&#x8054;&#x7CFB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x8BF4;&#x8FD9;&#x6B3E;&#x673A;&#x5668;&#x89E6;&#x6478;&#x677F;&#x662F;&#x514D;&#x9A71;&#x7684;&#xFF0C;&#x88C5;&#x4E0A;&#x7CFB;&#x7EDF;&#x5C31;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x7ED3;&#x679C;&#x4ED6;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x7684;&#x7CFB;&#x7EDF;&#x53C8;&#x600E;&#x4E48;&#x88C5;&#x90FD;&#x4E0D;&#x884C;&#x2026;&#x2026;&#x6700;&#x540E;&#x8FD9;&#x4F4D;&#x5C0F;&#x54E5;&#x95EE;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x6B21;&#x91CD;&#x88C5;&#x65F6;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x955C;&#x50CF;&#xFF0C;&#x8BF4;&#x8981;&#x4E0D;&#x4F60;&#x81EA;&#x5DF1;&#x91CD;&#x88C5;&#x8BD5;&#x8BD5;&#x3002;&#x5F04;&#x5F97;&#x6211;&#x4E5F;&#x65E0;&#x8BED;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x540E;&#x6765;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x628A;&#x6211;&#x7684;&#x673A;&#x5668;&#x62FF;&#x56DE;&#x4E86;&#x7EF4;&#x4FEE;&#x7AD9;&#xFF0C;&#x91CD;&#x88C5;&#x4E86;&#x4E00;&#x6B21;&#x51FA;&#x5382;&#x7CFB;&#x7EDF;&#x3002;&#x89E6;&#x6478;&#x677F;&#x7684;&#x95EE;&#x9898;&#x603B;&#x7B97;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x4F46;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x53D7;&#x5C31;&#x662F;&#x8054;&#x60F3;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x633A;&#x6DF7;&#x4E71;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x6709;&#x505A;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x77E5;&#x8BC6;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x5BF9;&#x81EA;&#x5DF1;&#x65B0;&#x63A8;&#x7684;&#x65B0;&#x673A;&#x578B;&#x7684;&#x652F;&#x6301;&#x660E;&#x663E;&#x6EDE;&#x540E;&#x3002;&#x5305;&#x62EC;&#x4E00;&#x5F00;&#x59CB;&#x8FD9;&#x4F4D;&#x5DE5;&#x7A0B;&#x5E08;&#x60F3;&#x7528;PE&#x8FDB;&#x53BB;&#x673A;&#x5668;&#x770B;&#x4E00;&#x770B;&#x786C;&#x76D8;&#x60C5;&#x51B5;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;PE&#x5728;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#xFF0C;&#x6362;&#x4E86;&#x597D;&#x51E0;&#x5957;&#x624D;&#x8FDB;&#x53BB;&#xFF0C;&#x4E5F;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x5BF9;&#x65B0;&#x673A;&#x578B;&#x4E0D;&#x719F;&#x6089;&#x3002;&#x8FD9;&#x6B21;&#x552E;&#x540E;&#x7B97;&#x662F;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4F53;&#x9A8C;&#x8FD8;&#x662F;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x3002;&#x5305;&#x62EC;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x672C;&#x8EAB;&#x4E5F;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x4E0D;&#x5B89;&#x5B9A;&#x611F;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4E5F;&#x8FD8;&#x5728;&#x575A;&#x6301;&#x7528;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7F3A;&#x70B9;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x62B5;&#x6D88;&#x4E86;&#x6211;&#x5BF9;&#x5B83;&#x4F18;&#x70B9;&#x7684;&#x597D;&#x611F;&#x3002;&#x7528;&#x8D77;&#x6765;&#x603B;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x600E;&#x4E48;&#x8212;&#x670D;&#x3002;&#x5E76;&#x4E14;&#x56E0;&#x4E3A;&#x89E6;&#x6478;&#x677F;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x53EA;&#x80FD;&#x7EE7;&#x7EED;&#x7528;&#x5DE5;&#x4F5C;&#x7AD9;&#x91CD;&#x88C5;&#x7684;Win10&#x5BB6;&#x5EAD;&#x7248;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x75DB;&#x82E6;&#x3002;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x611F;&#x609F;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#xFF1A;&#x4E0B;&#x6B21;&#x6362;&#x673A;&#x6211;&#x4E0D;&#x4F1A;&#x518D;&#x60F3;&#x7740;&#x7701;&#x94B1;&#x4E86;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/laptop/">#laptop</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2020/11/16/douyin-auto-thumbup/">抖音自动点赞</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/08/24/acme-verify-error/">acme.sh的Verify error:Invalid response from报错</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<div id="valine-thread"></div>
<script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
<script src='//unpkg.com/valine/dist/Valine.min.js'></script>
<script>
    new Valine({
        el: '#valine-thread',
        appId: 'ntDA6wjf0rnD89w8PlMFlvnJ-MdYXbMMI',
        appKey: 'ubI8DQfMobLrHgNNXDRQzPya',
        notify: false,
        verify: false,
        avatar: '',
        placeholder: 'Comments',
        meta: ['nick', 'mail'],
        visitor: true,
        lang: ''
    })
</script>


</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 mykonakona&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.loli.net/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.loli.net/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.loli.net/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script> -->

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>




<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>